
// // КОРОТКИЕ ПРЕДЛОЖЕНИЯ И ФРАЗЫ
const greetingsWords = [
	"привет", "приветик", "приветы", "прет", "приветики", "приветствую", "приветствие",
	"здорово","здорова",  "здрасте", "здарова","здравствуйте", "здравствуй",
	"ку", "куку",
	"хай","хей", "hi","hello",
]
const greetingsMessages = [
	"Пф, привет",
	"Ку",
	"Ага, здорово",
	"Здорова",
	"Ну привет",
	"Здравствуйте",
]
// //короткие приветствия и пожелания
const negativeMessages =[
	"Ты мне погруби", 
	"Язык промой с мылом",
	"Ты берега не попутал?",
	"Вонючие словечки ты подбираешь",
	"У тебя из пасти воняет",
	"Фу таким быть",
]
const negativeWords =[
	"блять",
	"пиздец",
	"сука","суки","сук","суке","сукам","суку","сукой","сукою","суками","суках",
	"сучка",
	"нахуй","нахуя","нихуя","охуеть","хуйня",
	"хуй", "хуи","хуя","хуев","хую","хуем","хуями","хуе","хуях",
	"хуйло","хуйла","хуил","хуйлу","хуйлам","хуйлом","хуйлами","хуйле","хуйлах",
	"ебать",
	"пизда",
	"говно","говна","говен","говну","говнам","говном","говнами","говне","говнах",

	"hole",
	"musa",
	"fuck",
	"fucking",
	"fucker",
	"fucks",
	"fucked",
	"motherfucker",
	"motherfuck",
	"motherfucking",
	"lox",
	"bitch",
	"bitches",
	"shit",
	"shitting",
	"shitted",
	"shithole",
	"sht",
	"crap",
	"poop",
	"ass",
	"slut",
	"whore",
	"bullshit",
	"bullshitting",
	"bullshitted",
	"idiot",
	"asshole",
	"dick",
	"cunt",
	"pussy",
	"dumb",
	"dumber",
	"dumbest",
	"dumbass",
	"dull",
	"nyb",
	"noob",
	"damn",
	"freak",
	"freaking",
	"freaked",
	"damn",
	"douchebag",
	"gay",
	"fag",
	"faggot",
	"homo",
	"nigger",
	"niger",
	"niga",
	"nigga",
	"bastard",
	"jerk",
	"prick",
	"loser",
	"sucker",
	"nerd",
	"retard",
	"retarded",
	"dafaq",
	"hooker",
	"arse",
	"piss",
	"cock",
	"dickhead",
	"bollocks",
	"testicles",
	"bugger",
	"buggering",
	"buggers",
	"buggered",
	"hell",
	"goddamn",
	"minger",
	"munter",
	"knob",
	"twat",
	"bellend",
	"snatch",
	"minge",
	"fucko",
	"fuckhead",
	"asshead",
	"hoe",
	"jade",
	"dork",
	"dorks",
	"dorky",
	"pansy",
	"scumbag",
	"wanker",
	"prat",
	"dwarf",
	"midget", "midgets",
	"gnome",
	"moron", "morons"

]
// //реакции на бранные слова и оскорбления
const noIdeaMessages = [
	"Не понимаю о чем ты",
	"Я понял",
	"Я так и думал",
	"Даже не знаю",
	"Вот сам и думай об этом",
	"Посыл неясен",
	"Смутно представляю, о чём ты говоришь",
	"Просто воздух сотрясаешь",
]
// //короткие реакции на полное непонимание темы
const generalQuestions = [
	"что","че", "чего","що","чем",
	"где","куда","откуда",
	"когда",
	"почему","зачем",
	"кто","кем",
	"какой","какая","какое","какие","каков","каково","какова","каковы","который","которая","которое","которые","каким","какими",
	"чей","чья","чье","чьи",
	"whom","кому",
	"как",
]
const rudeWords = [
	"лох", "лохи","лоха","лоху","лохов","лохам","лохом","лохами","лохе","лохах",
	"лошпед","лошпеды","лошпеда","лошпедов","лошпеду","лошпедам","лошпедом","лошпедами","лошпеде","лошпедах",
	"лошара","лошары","лошар","лошаре","лошарам","лошару","лошарой","лошарою","лошарами","лошарах",
	"лошок","лошки","лошка","лошков","лошку","лошкам","лошком","лошками","лошке","лошках",

	"дурак","дураки","дураку","дурака","дуракам","дураков","дураком","дураками","дураке","дураках",
	"дура","дуры","дур","дуре","дурам","дуру","дурой","дурою","дурами","дурах",
	"дурачина","дурачины","дурачин","дурачине","дурачинам","дурачину","дурачиной","дурачиною","дурачинами","дурачине","дурачинах",
	
	"придурок","придурки","придурка","придурков","придурку","придуркам","придурком","придурками","придурке","придурках",
	"болван","болваны","болвана","болванов","болвану","болванам","болванами","болване","болванах",
	"нуб","нубы","нуба","нубов","нубу","нубам","нубами","нубе","нубах",
	"сопляк","сопляки","сопляка","сопляков","сопляку","соплякам","сопляком","сопляками","сопляке","сопляках",
	"олух","олухи","олуха","олухов","олуху","олухам","олухом","олухами","олухе","олухах",
	"идиот","идиоты","идиота","идиотов","идиоту","идиотам","идиотом","идиотами","идиоте","идиотах",

	"мудак","мудаки","мудака","мудаков","мудаку","мудакам","мудаков","мудаком","мудаками","мудаке","мудаках",
	"мудень","мудни","мудня","мудней","мудню","мудням","муднем","муднями","мудне","муднях",

	"гей","геи","гея","геев","гею","геям","геем","геями","гее","геях",
	"педик","педики","педика","педиков","педику","педикам","педиком","педиками","педике","педиках",
	
	"член","члены","члена","членов","члену","членам","членом","членами","члене","членах",
	"пенис","пенисы","пениса","пенисов","пенису","пенисам","пенисом","пенисами","пенисе","пенисах",

	"сосунок","сосунки","сосунка","сосунков","сосунку","сосункам","сосунком","сосунками","сосунке","сосунках",

	"опущенный","опущен","опущеная",
	"тупой","тупая","тупое",
	"вафлер",
	"очко",
	"жопа","жопу",
	"задница","задницу",
	"зад",
	"кал","кала",
]
const rudeMessages = [
	"При мне так не выражайся",
	"Плохо ты говоришь",
	"Ты полон злобы, раз пишешь такое",
	"Позор так писать",
	"Одумайся",
	"Позоришься сейчас",
]
// //общие грубости
const randomSmiles = [
	"))",
	";)",
	":)",
	"0_0",
	"лол",
	"кек",
	"xd",
	"хд",
	"хе",
]
//смайлики из знаков

// // ДЛИННЫЕ ПРЕДЛОЖЕНИЯ И ФРАЗЫ
const smalltalk = [
	"Смотрел новый фильм Озона?",
	"Смотрел последний матч в лиге?",
	"Что ты слушаешь в последнее время?",
	"Ты слышал про недавние сионистские гонения?",
	"Ты не ощущаешь общественный запрос на марксистский ревизионизм?",
	"Я успел разочароваться в левацких настроениях Франции, что ты думаешь?",
	"Ты не смотрел фильмы того румынского режиссёра?",
	"Мне неприятно думать о том, что наше поколение осталось без пенсии",
	"Ты знаешь, что мне не нужно твоё ютубовское мнение?",
	"Ты знал, что просто сотрясаешь воздух?",
	"Хочу напомнить тебе о том, что Bring Me The Horizon невозможно слушать",
	"Ах да, некоторые новые баскетболисты NBA просто кидают с середины поля. Это необычно",
	"Ты ждёшь новый релиз Эминема?",
	"Я не понимаю эту соковыжималку с современными артистами. Сперва альбом, потом туры. Лейблы выжимают из них все соки",
]
// //small talk
const quotes = [
	"Сила – не в бабках. Ведь бабки – уже старые",
	"Я живу, как карта ляжет. Ты живёшь, как мамка скажет",
	"Если заблудился в лесу, иди домой",
	"Запомни: всего одна ошибка – и ты ошибся",
	"В жизни всегда есть две дороги: одна — первая, а другая — вторая",
	"Мы должны оставаться мыми, а они – оними",
	"Работа — это не волк. Работа — ворк. А волк — это ходить",
	"Как говорил мой дед, «Я твой дед»",
	"Без подошвы тапочки — это просто тряпочки",
	"Жи-ши пиши от души",
]
const quotesAsking = [
	"цитата","цитаты","цитат","цитате","цитатам","цитату","цитатой","цитатою","цитатами","цитатах",
	"совет","советы","совета","советов","совету","советам","советом","советами","совете","советах",
	"поговорка","поговорки","поговорок","поговорке","поговоркам","поговорку","поговоркой","поговоркою","поговорками","поговорках",
	"наставление","наставления","наставлений","наставлению","наставлениям","наставлением","наставлениями","наставлении","наставлениях",
	"мотивация","мотивации","мотиваций","мотивациям","мотивацию","мотивацией","мотивациею","мотивациями", "мотивациях",
	"мудрость", "мудрости","мудростей","мудростями","мудростью","мудростях",
]
// //длинные цитаты-наставления
const weatherWords = [
	"погода","погоды","погод","погоде","погодам","погоду","погодой","погодою","погодами","погодах",
	"непогода","непогоды","непогод","непогоде","непогодам","непогоду","непогодой","непогодою","непогодами","непогодах",
	"дождь","дожди","дождя","дождей","дождю","дождям","дождем","дождями","дожде","дождях",
	"ливень","ливни","ливня","ливней","ливню","ливням","ливнем","ливнями","ливне","ливнях",
	"ветер","ветра","ветры","ветров","ветру","ветрам","ветром","ветрами","ветре","ветрах",
	"град","грады","града","градов","граду","градам","градом","градами","граде","градах",
	"снег","снега","снегов","снегу","снегам","снегом","снегами","снеге","снегах",
	"влажно","облачно","дождливо","снежно","холодно","тепло","жарко","туманно","пасмурно","жарко","жаркое","жаркая","ветрено",
	"гроза","грозы","гроз","грозе","грозам","грозу","грозой","грозою","грозами","грозе","грозах",
	"ураган","ураганы","урагана","ураганов","урагану","ураганам","ураганом","ураганами","урагане","ураганах",
]
const weatherMessages = [
	"Сегодня очень солнечно.",
	"Завтра обещают дождь.",
	"Вчера была сильная гроза.",
	"Сегодня на яме туманно.",
	"Прогнозируют теплую погоду на выходные.",
	"Недавно шел град, прикинь.",
	"На небе видны красивые радужные цвета.",
	"Вчера был сильный ветер.",
	"Послезавтра обещают сильный туман.",
	"Сегодня тихая погода без ветра.",
	"На небе видны красивые облака.",
	"Вчера была метель.",
	"Сегодня очень жарко.",
	"Завтра обещают метель.",
	"Вчера был мороз.",
	"На улице мокро после дождя.",
	"Прогнозируют снегопад на следующую неделю.",
	"Сегодня ветрено.",
	"Завтра обещают град.",
	"Вчера было облачно.",
	"На улице пасмурно.",
	"Прогнозируют аномально жаркое лето.",
	"Сегодня утром был густой туман.",
	"Завтра обещают переменную облачность.",
	"Вчера была полная луна.",
	"На улице светит яркое солнце.",
	"Прогнозируют сильный грозовой ветер.",
	"Сегодня прогнозируют ураган.",
	"Завтра обещают солнечную погоду.",
	"На улице холодно.",
	"Прогнозируют сильный снегопад.",
	"Сегодня воздух очень свежий.",
	"Завтра обещают жару.",
	"Вчера был холодный ветер.",
	"На небе видны прекрасные звезды.",
	"Прогнозируют солнечную погоду на выходные.",
	"Сегодня влажно.",
	"Завтра обещают умеренный климат.",
	"Вчера была непогода.",
	"На улице смешанная погода.",
]
// //мнения о погоде
const jokes = [
	"Какой самый любимый фильм у Макрона? 'Французский поцелуй'!",
	"Как Лукашенко сказал Макрону, что намекает ЕС на провокации? 'Атака макаронов на Макрона!'",
	"Какой алгоритм использует Макрон для принятия решений? 'Французский двушка-трешка'!",
	"Какую стратегию применил Макрон для победы на выборах? 'Французский Пощечина'!",
	"Англичане обвинили в своем поражении бразильского судью, который назначил в ворота французов всего два пенальти",
	"Собянин запретил выходить на работу прибывшим из Италии, Франции, Германии и Испании.Работа мэрии, Госдумы и правительства парализована",
	"Современная глобализация - это когда на смену немецким автомобилям, американским компьютерам и французским духам приходят китайские автомобили, китайские компьютеры и китайские духи",
	"В Швейцарии официальными языками являются немецкий, французский, итальянский, а весь внутренний документооборот на иврите",
	"Россияне искренне возмущены бесчеловечной пенсионной реформой во Франции",
	"А никого вообще не смущает, что звезды качества ресторанам дает французская шиномонтажка?",
	"Сборная Франции по футболу стала единственной африканской командой, вышедшей в финал ЧМ во второй раз в истории",
	"Только недальновидные французы ищут женщину. Умные люди сразу ищут деньги",
	"Макрон заявил, что Россия начала гибридную мировую войну и Франция, как всегда, готова к гибридной капитуляции",
	"Пока араб не грянет, француз не перекрестится",
	"Представители беженцев, осевших в Германии, Франции и Венгрии, встретились, чтобы обсудить проблему интеграции коренных граждан Европы",
	"Если вам говорят, что быть тупым в 21 веке - моветон, не парьтесь! Я гуглил, это херня какая-то на французском",
	"После разрешения однополых браков во Франции три мушкетера выглядят все более подозрительно",
	"На чемпионате мира по футболу за сборную Франции болела вся Африка",
]
const jokesWords = [
	"шутка","шутки","шуток","шутке","шуткам","шутку","шуткой","шуткою","шутками","шутках",
	"веселье","веселья","веселий","веселью","весельям","весельем","весельями","весельях",
	"анекдот","анекдоты","анекдота","анекдотов","анекдоту","анекдотам","анекдотом","анекдотами","анекдоте","анекдотах",
	"хохма","хохмы","хохм","хохме","хохма","хохму","хохмой","хохмою","хохмами","хохмах",
]
// //шутки

// // СЛОВА ДЛЯ КОНСТРУИРОВАНИЯ РАЗБОРНЫХ ПРЕДЛОЖЕНИЙ
const conjunction = [
	"и",
	"но",
	"хотя",
	"а",
	"еще",
	"а еще",
	"однако",
	"однако же",
	"только",
	"а все же",
	"но все же",
	"но еще",
	"только вот",
	"хоть и",
	"впрочем,",
	"и все же",
	" ",
]
// // союзны и союзные слова
const agreeWords = [
	"да",
	"ага",
	"угу",
	"ну да",
	"конечно",
	"ок",
	"хорошо",
	"ладно",
	"разумеется",
	"точно",
	"круто",
	"естественно",
	"отлично",
]
// //слова согласия, как короткие, так и отдельные фразы
const disagreeWords = [
	"нет",
	"неа",
	"да не",
	"да ну",
]
// //слова несогласия, как короткие, так и отдельные фразы
const introductoryWords = [
	"наверное",
	"может",
	"вообще",
	"я бы сказал",
	"так вот",
]
// //вводные вступительные, заключительные и нейтральные фразы
const descriptionWords = [
	"метафорически",
	"двойственно",
	"запутанно",
	"выразительно",
	"неординарно",
	"беспощадно",
	"фантастически",
	"изысканно",
	"характерно",
	"волнующе",
	"величественно",
	"бесхарактерно",
	"раздражающе",
	"язвительно",
	"изящно",
	"беспрекословно",
	"холодно",
	"непостижимо",
	"недоуменно",
	"безапелляционно",
	"плохонько",
	"небезразлично",
	"восторженно",
	"целомудренно",
	"профессионально",
	"пассивно",
	"мягонько",
	"беспрецедентно",
	"неодолимо",
	"недоверчиво",
	"бесшумно",
	"проницательно",
	"порядково",
	"безудержно",
	"бесстрашно",
	"сверхчувственно",
	"благородно",
	"безголосо",
	"ловко",
	"бесчувственно",
	"страстно",
	"развязно",
	"плачевно",
	"прозорливо",
	"душевно",
	"напыщенно",
	"трезво",
	"бесправно",
	"безнравственно",
	"безжалостно",
	"бескорыстно",
	"беспринципно",
	"нечисто",
	
]
// //прилагательные и наречия для выражения своего мнения
const positiveDescriptionWords = [
	"супер",
	"смело",
	"искренне",
	"положительно",
	"дружелюбно",
	"оптимистично",
	"внимательно",
	"выразительно",
	"весело",
	"великодушно",
	"жизнерадостно",
	"энергично",
	"спонтанно",
	"находчиво",
	"активно",
	"решительно",
	"уверенно",
	"обаятельно",
	"креативно",
	"благоприятно",
	"эмоционально",
	"спокойно",
	"умело",
	"вдохновенно",
	"вежливо",
	"эффективно",
	"грациозно",
	"мудро",
	"успешно",
	"гармонично",
	"утонченно",
	"эффектно",
	"логично",
	"безопасно",
	"прогрессивно",
	"великолепно",
	"качественно",
	"уместно",
	"ревностно",
	"изящно",
	"благородно",
	"жизнеутверждающе",
	"сильно",
	"крепко",
	"достойно",
	"ясно",
	"красиво",
	
]
// //позитивные слова
const neutralWords = [
	"хорошо",
	"понял",
	"ок",
	"понятно",
	"разумеется",
	"хорошо",
	"ладно",
	"нормально",
	"согласен",
	"принято",
	"все хорошо",
	"именно",
	"понимаю",
	"приемлемо",
	"верно",
	"уверен"
]
// //нейтральные ответы
const genre = [
	"жанр","жанры","жанра","жанров","жанру","жанрам","жанром","жанрами","жанре","жанрах",
	"тип","типы","типа","типов","типу","типам","типом","типами","типе","типах",
	"разновидность","разновидности","разновидностей","разновидностям","разновидностью","разновидностями","разновидностях",
	"вид","виды","вида","видов","виду","видам","видом","видами","виде","видах",
]
// //слово жанр, вид и тд

// // РЕАКЦИЯ НА ОТДЕЛЬНЫЕ ИМЕНА И ОБРАЩЕНИЯ
const unknownNames = [
	"frank",
	"joe",
	"john",
	"mark",
	"antony",
	"tony",
	"albert",
	"adolf",
	"sam",
	"peter",
	"harry",
	"toby",
	"jason",
	"donald",
	"steven",
	"kevin",
	"brian",
	"eric",
	"dennis",
	"денис",
	"ден",
	"александр",
	"андрей",
	"владимир",
	"дмитрий",
	"евгений",
	"иван",
	"настя",
	"анастасия",
	"влада",
	"vlada",
	"nasty",
	"helen",
	"лена",
	"max",
	"толик",
	"толя",
	"катя",
	"аня",
	"даша",
	"dasha",
	"ксюша",
	"таня",
	"антон",
	"лиза",
	"елизавета",
	"эльза",
	"elizabeth",
	"beth",
	"lisa",
	"максим",
	"никита",
	"николай",
	"олег",
	"павел",
	"станислав",
	"анна",
	"александра",
	"виктория",
	"дарья",
	"екатерина",
	"елена",
	"ирина",
	"ксения",
	"мария",
	"наталья",
	"ольга",
	"светлана",
	"татьяна",
	"юлия",
	"юлия",
	"александр",
	"иван",
	"максим",
	"дмитрий",
	"никита",
	"илья",
	"павел",
	"андрей",
	"евгений",
	"станислав",
	"владимир",
	"кирилл",
	"георгий",
	"николай",
	"роман",
	"александр",
	"иван",
	"андрей",
	"максим",
	"дмитрий",
	"илья",
	"евгений",
	"никита",
	"владимир",
	"павел",
	"станислав",
	"кирилл",
	"николай",
	"владислав",
	"анатолий",
	"игорь",
	"роман",
	"alexander",
	"andrey",
	"vladimir",
	"dmitriy",
	"eugene",
	"ivan",
	"maksim",
	"michael",
	"nikita",
	"pavel",
	"nikolai",
	"paul",
	"sergey",
	"stanislav",
	"anna",
	"alexandra",
	"victoria",
	"daria",
	"catherine",
	"elena",
	"irina",
	"ksenia",
	"maria",
	"natalia",
	"olga",
	"svetlana",
	"tatiana",
	"alexander",
	"ivan",
	"maksim",
	"dmitriy",
	"sergey",
	"daniel",
	"nikita",
	"ilya",
	"paul",
	"andrey",
	"eugene",
	"stanislav",
	"vladimir",
	"kirill",
	"george",
	"nikolai",
	"vladislav",
	"ivan",
	"andrey",
	"maksim",
	"dmitriy",
	"sergey",
	"ilya",
	"eugene",
	"nikita",
	"vladimir",
	"paul",
	"stanislav",
	"daniel",
	"kirill",
	"nikolai",
	"vladislav",
	"anatoly",
	"igor",
	"roman",
	"liam", 
	"olivia", 
	"noah", 
	"emma", 
	"oliver", 
	"ava", 
	"elijah", 
	"charlotte", 
	"william", 
	"sophia",
	"james",
	"mia",
	"benjamin",
	"isabella",
	"lucas",
	"amelia",
	"mason",
	"harper",
	"ethan",
	"evelyn",
	"alexander",
	"abigail",
	"henry",
	"emily",
	"jacob",
	"elizabeth",
	"sofia",
	"daniel",
	"avery",
	"ella",
	"david",
	"scarlett",
	"luke",
	"grace",
	"jack",
	"chloe",
	"jackson",
	"lily",
	"ryan",
	"madison",
	"nathan",
	"zoe",
	"samuel",
	"layla",
	"joseph",
	"aria",
	"evan",
	"nora",
	"dylan",
	"hannah",
	"anthony",
	"leah",
	"isaac",
	"lillian",
	"gabriel",
	"aaliyah",
	"carter",
	"addison",
	"owen",
	"aubrey",
	"wyatt",
	"bella",
	"natalie",
	"leo",
	"mila",
	"jaxon",
	"nova",
	"julian",
	"serenity",
	"christopher",
	"riley",
	"joshua",
	"kimberly",
	"andrew",
	"penelope",
	"lincoln",
	"victoria",
	"theodore",
	"stella",
	"caleb",
	"ellie",
	"hunter",
	"brooklyn",
	"levi",
	"aurora",
	"jonathan",
	"willow",
	"isaiah",
	"claire",
	"aaron",
	"savannah",
	"elliot",
	"nevaeh",
	"adrian",
	"hazel",
	"nolan",
	"luna",
	"charles",
	"lydia",
	"eli",
	"camila",
	"connor",
	"skylar",
	"jordan",
	"lillian",
	"christian",
	"madelyn",
	"landon",
	"raelynn",
	"asher",
	"kaylee",
	"nicholas",
	"gianna",
	"colton",
	"isabelle",
	"dominic",
	"nina",
	"jaxson",
	"sara",
	"greyson",
	"alexa",
	"ian",
	"isabel",
	"adam",
	"hayden",
	"parker",
	"trinity",
	"austin",
	"lyla",
	"kai",
	"faith",
	"elias",
	"talia",
	"carson",
	"jade",
	"bentley",
	"elena",
	"ryder",
	"esther",
	"kingston",
	"mackenzie",
	"xavier",
	"paisley",
	"camden",
	"athena",
	"kaden",
	"valentina",
	"mateo",
	"lucy",
	"zachary",
	"annabelle",
	"sebastian",
	"daisy",
	"jace",
	"josephine",
	"tyler",
	"brielle",
	"luca",
	"delilah",
	"devin",
	"sophie",
	"miles",
	"vivian",
	"micah",
	"callie",
	"antonio",
	"megan",
	"brody",
	"rebecca",
	"jayden",
	"holly",
	"andrea",
	"piper",
	"tristan",
	"leilani",
	"julius",
	"ariana",
	"brayden",
	"daniela",,
	"jasmine",
	"jax",
	"danielle",
	"walker",
	"laila",
	"robert",
	"rylee",
	"kaiden",
	"adeline",
	"chance",
	"mckenna",
	"phoenix",
	"finn",
	"jennifer",
	"joel",
	"mariana",
	"nicolas",
	"camilla",
	"preston",
	"gabriella",
	"damian",
	"fiona",
	"colin",
	"maggie",

]
// //незнакомые имена
const alex = [
	"alex",
	"lexa",
	"леха","лехи","лех","лехе","лехам","леху","лехой","лехою","лехами","лехе","лехах",
	"леша","леши","леш","леше","лешам","лешу","лешей","лешею","лешами","лешах",
	"алешка",
	"алеша","алеши","алеш","алеше","алешам","алешу","алешей","алешею","алешами","алешах",
	"origin",
	"lilkitchen",
	"parfe",
	"алексей","алексеи","алексея","алексеев","алексею","алексеям","алексеем","алексеями","алексее","алексеях",
	"alyosha",
	"lex",
	"alexei",
	"китчен","китчена","китчену","китченом","китчены",
]
const alexResponse = [
	"Ты про того латыша?",
	"Лил Китчен, помню такого",
	"У него дома висит портрет Медведева",
	"Он видит на все 100%",
	"Это он показал мне видео с коровой и гноем",
	"Яха МС, читает про мох",
]
// //реакция на Алёшу
const alexLang = [
	"литовский",
	"латышский",
	"французский",
]
// //Языки Алёши
const misha = [
	"миша","миши","миш","мише","мишам","мишу","мишей","мишею","мишами","мишах",
	"миха","михи","мих","михе","михам","миху","михой","михою","михами","михах",
	"мишаня","мишани","мишань","мишаням","мишаню","мишаней","мишанями","мишанях",
	"михаил","михаилы","михаилу","михаилам","михаилу","михаилом","михаилами","михаилах",
	"мишка","мишки","мишек","мишкам","мишку","мишкой","мишкою","мишками","мишках",
	"бибер","биберы","биберу","биберам","бибером","биберами","биберах",
	"misha",
	"mike",
	"michael",
	"theomorphic",
	"soters",
	"maxwell",
	"felixmk",
	"felix",
]
const mishaMessages =[
	"Он Бибер",
	"Он слишком часто шутит про моего отца",
	"Бибер преподает английский, хотя сам его не знает",
	"Он с каждым годом все толще и толще",
	"У него две акции Газпрома и куча псевдоуверенности в себе"
]
const mishaActivities = [
	"слушать музыку для нубов",
	"убеждать меня в словах, которые я не произносил",
	"читать книги каких-то фриков",
	"играть в Майн. Так и не перерос детские игры",
]
// //реакции на Мишу

const thomas = [
	"thomas",
	"tommy",
	"lavandera",
	"artem",
	"repin",
	"прачка","прачку","прачке",
	"артем","артемы","артема","артемов","артему","артемам","артемом","артемами","артеме","артемах",
	"томми",
	"томас",
	"артом",
	"репин",
	"дон","доны","дона","донов","дону","донам","доном","донами","доне","донах",
]
const thomasMessages = [
	"Большой Дон. Даже не знаю, как он там",
	"Ты будешь вымыт за это упоминание",
	"Лавандера, он в загнивающей Европе сейчас",
	"Первый перед первыми, Артом",
]
// //реакция на Томми Лавандеру

const sysa = [
	"сыса", "сысу","сысе","сысой","сысе",
	"серега","серегу","сереге","серегой","сереге",
	"сергей", "сергеи","сергея","сергеев","сергею","сергеям","сергеем","сергеями","сергее","сергеях",

]
const sysaMessages = [
	"А, Сыса. Он где-то на Дальнем Востоке вроде",
	"Сыса, ровный парень. Давно его не видел",
	"Сыса поди рвется к успеху где-то там"
]
// //реакции на Сысу

const duncan = [
	"данкан","данкана","данкану","данкане","данканом","данканов","данканова",
	"данил","данилы","данила","данилов","данилу","данилам","данилом","данилами","даниле","данилах",
	"даня","даню","дане","дань","дани","даней",
	"друзенко",
]
const duncanMessages = [
	"Давненько его не видел на заводе",
	"Раньше он часто играл в баскет",
	"Давно не кидает мячик",
	"Я даже не знаю, где он",
]
// //реакция на Данкана

const losCallingWords = [
	"los", "moose", "elk",
	"егор", "егора","егоры","егоров","егору","егорам","егором","егорами","егоре","егорах",
	"егорка", "егорик", "egor", 
	"лось","лоси","лося","лосей","лосю","лосям","лосем","лосями","лосе","лосях",
	"великанов",
	"velie",
	"chi",
	"чи",
	"чивандер",
	"чивандерджексон",
	"мастерчивандерджексон",
]
const losCallingMessages = [
	"Что?",
	"Ну",
	"Чего?",
	"??",
	"Ага",
]
// //назвали самого Лося

const godWords = [
	"бог","боги","бога","богов","богу","богам","богом","богами","боге","богах","боже",
	"господь","господа","господу","господом","господе","господи",
	"всевышний","всевышнего","всевышнему","всевышним","всевышнем",
	"иисус","иисуса","иисусу","иисусом","иисусе",
	"христос","христоса","христосу","христосом","христосе",
	"религия","религии","религий","религиям","религию","религией","религею","религиями","религиях",
]
// // реакция на бога
const family = [
	"семья","семьи","семьей","семей","семье","семьям","семью","семьей","семьею","семьями","семье","семьях",
	"семейство","семейства","семейств","семейству","семействам","семейством","семействами","семействе","семействах",
	"родитель","родители","родителя","родителей","родителю","родителям","родителем","родителями","родители","родителях",
	"предок","предки","предка","предков","предку","предкам","предком","предками","предке","предках",
	"родственник","родственники","родственника","родственников","родственнику","родственникам","родственником","родственниками","родственнике","родственниках",
	"родня","родни","родней","родне","родням","родню","родней","роднею","роднями","роднях",
	"родные","родных","родным","родными",
	"близкие","близких","близким","близкими",
	"family","фэмили",
]
// // реакция на семью
const father = [
	"отец","отцы","отца","отцов","отцу","отцам","отцом","отцами","отце","отцах",
	"папа","папы","пап","папе","папам","папу","папой","папою","папами","папах",
	"папка","папки","папок","папке","папкам","папку","папкой","папкою","папками","папках",
	"папаня","папани","папань","папане","папаням","папаню","папаней","папанею","папанями","папанях",
	"папаша","папаши","папаш","папаше","папашам","папашу","папашу","папашей","папашею","папашами","папашах",
	"батя","бати","батей","бате","батям","батю","батею","батями","бате","батях","бать",
]
// // реакция на отца
const mother = [
	"мама","мамы","мам","маме","мамам","маму","мамой","мамою","мамами","мамах","ма",
	"мать","матери","матерей","матерям","матерей","матерью","матерями","матерях",
	"матушка","матушки","матушек","матушке","матушкам","матушку","матушек","матушкой","матушкою","матушками","матушках",
	"мамка","мамки","мамок","мамке","мамкам","мамку","мамок","мамкой","мамкою","мамками","мамках",
	"мамаша","мамаши","мамаш","мамаше","мамашам","мамашу","мамашей","мамашею","мамашами","мамашах",
	"mother","мазер",
]
// // реакция на маму

const youWords = [
	"ты","тебя","тебе","тобой","тобою",
	"вы","вас","вам","вами",
]
// //обращение напрямую к боту
const youPossessiveWords = [
	"твой","твое","твоя",
	"твоего","твоей","твоих",
	"твоему","твоим",
	"твою", "твои",
	"ваш","ваше","ваша","ваши",
	"вашего","вашей","ваших",
	"вашему","вашим","вашу","ваших",
	"вашею","вашими","вашем",

]
// //притяжательный падеж к боту
const meWords = [
	"я","меня","мне","мной","мною",
]
// //обращение от первого лица
const mePossessWords = [
	"мой","мое","моя","моего","моей","моих","моему","моим","мою","мои",
]
// //первое лицо в притяжательном падеже

// // КАТЕГОРИИ РАЗНЫХ ПОНЯТИЙ
const foodWords = [
	"еда","еды","еде","еду","едой","едою",
	"пища","пищи","пищ","пище","пищам","пищу","пищей","пищею","пищами","пищах",
	"блюдо","блюда","блюд","блюду","блюдам","блюдом","блюдами","блюде","блюдах",
	"продукт","продукты","продукта","продуктов","продукту","продуктам","продуктом","продуктами","продукте","продуктах",
]
const foodNames = [

	//сладости
	"сладость","сладости","сладостей","сладостям","сладостью","сладостями","сладостях",
	"трубочка","трубочки","трубочек","трубочке","трубочкам","трубочку","трубочкой","трубочкою","трубочками","трубочке","трубочках",
	"вафля","вафли","вафель","вафле","вафлям","вафлю","вафлей","вафлею","вафлями","вафлях",
	"конфета","конфеты","конфет","конфете","конфетам","конфету","конфетой","конфетою","конфетами","конфете","конфетах",
	"шоколад","шоколады","шоколадов","шоколада","шоколаду","шоколадам","шоколадом","шоколадами","шоколаде","шоколадах",

	//продукты
	"масло","масла","масел","маслу","маслам","маслом","маслами","масле","маслах",
	"сыр","сыры","сыра","сыров","сыру","сырам","сыром","сырами","сыре","сырах",
	"творог","твороги","творога","творогов","творогу","творогом","твороге","творогах",
	"cюрстремминг","cюрстремминги","cюрстреммингу","cюрстреммингам","cюрстреммингом","cюрстреммингами","cюрстремминге","cюрстреммингах",
	"мясо","мяса","мясу","мясам","мясом","мясе",
	"рыба","рыбы","рыб","рыбе","рыбам","рыбой","рыбою","рыбами","рыбах",
	"яйцо","яйца","яиц","яйцу","яйцам","яйцом","яйцами","яйце","яйцах",
	"стейк","стейки","стейка","стейков","стейку","стейкам","стейком","стейками","стейке","стейках",
	"макароны","макарон","макаронами","макаронам","макаронах",
	"паста","пасты","паст","пасте","пастам","пасту","пастой","пастою","пастами","пасте","пастах",

	//ягоды
	"ягода", "ягоды","ягод","ягоде","ягодам","ягоду","ягодой","ягодою","ягодами","ягодах",
	"авокадо",
	"помидор","помидоры","помидора","помидоров","помидор","помидору","помидорам","помидором","помидорами","помидоре","помидорах",
	"томат","томаты","томата","томатов","томату","томатам","томатом","томатами","томате","томатах",
	"вишня","вишни","вишен","вишне","вишням","вишню","вишни","вишней","вишнею","вишнями","вишнях",

	//орехи
	"орех","орехи","ореха","орехов","ореху","орехам","орехом","орехами","орехе","орехах",

	//овощи
	"овощ","овощи","овоща","овощей","овощу","овощам","овощем","овощами","овоще","овощах",
	"картошка","картошки","картошек","картошке","картошкам","картошку","картошкой","картошкою","картошками","картошке","картошках",
	"огурец","огурцы","огурца","огурцов","огурцу","огурцам","огурцом","огурцами","огурце","огурцах",
	"помидор", "помидоры", "помидора", "помидору", "помидорами", "помидорах",
	"морковь", "моркови", "морковью", "морковях",
	"капуста", "капусты", "капусты", "капусту", "капустой", "капустах",
	"баклажан", "баклажаны", "баклажана", "баклажану", "баклажанами", "баклажанах",
	"картофель", "картофели", "картофеля", "картофелю", "картофелем", "картофеле",
	"лук", "луки", "лука", "луку", "луками", "луках",
	"чеснок", "чесноки", "чеснока", "чесноку", "чесноками", "чесноках",
	"шпинат", "шпинаты", "шпината", "шпинату", "шпинатами", "шпинатах",
	"редиска", "редиски", "редиской", "редиске", "редиску", "редисками", "редисках",
	"тыква", "тыквы", "тыкву", "тыквой", "тыквах",
	"брокколи", 
	"цуккини",
	"патиссон", "патиссоны", "патиссона", "патиссону", "патиссонами", "патиссонах",
	"кабачок", "кабачки", "кабачка", "кабачку", "кабачками", "кабачках",

	//фрукты
	"фрукт","фрукты","фрукта","фруктов","фрукту","фруктам","фруктом","фруктами","фрукте","фруктах",
	"яблоко","яблоки","яблок","яблоку","яблокам","яблоком","яблоками","яблоке","яблоках",
	"банан","бананы","банана","бананов","банану","бананам","бананом","бананами","банане","бананах",
	"манго",
	"яблоко", "яблоки", "яблока", "яблоку", "яблоками", "яблоках",
	"груша", "груши", "грушу", "грушами", "грушах",
	"апельсин", "апельсины", "апельсина", "апельсину", "апельсинами", "апельсинах",
	"банан", "бананы", "банана", "банану", "бананами", "бананах",
	"киви",
	"мандарин", "мандарины", "мандарина", "мандарину", "мандаринами", "мандаринах",
	"ананас", "ананасы", "ананаса", "ананасу", "ананасами", "ананасах",
	"слива", "сливы", "сливу", "сливами", "сливах",
	"вишня", "вишни", "вишню", "вишнями", "вишнях",
	"абрикос", "абрикосы", "абрикоса", "абрикосу", "абрикосами", "абрикосах",
	"персик", "персики", "персика", "персику", "персиками", "персиках",
	"гранат", "гранаты", "граната", "гранату", "гранатами", "гранатах",
	"грейпфрут", "грейпфруты", "грейпфрута", "грейпфруту", "грейпфрутами", "грейпфрутах",
	"инжир", "инжиры", "инжира", "инжиру", "инжирами", "инжирах",
	"крыжовник", "крыжовники", "крыжовника", "крыжовнику", "крыжовниками", "крыжовниках",
	"арбуз", "арбузы", "арбуза", "арбузу", "арбузами", "арбузах",
	"дыня", "дыни", "дыню",
	"тыква", "тыквы", "тыкву",

	//крупы
	"крупа","крупы","круп","крупе","крупам","крупу","крупой","крупою","крупами","крупе","крупах",
	"гречка","гречки","гречек","гречкам","гречку","гречкой","гречкою","гречками","гречке","гречках",
	"рис","рисы","риса","рисов","рису","рисам","рисом","рисами","рисе","рисах",

	//выпечка
	"выпечка","выпечки","выпечек","выпечке","выпечкам","выпечку","выпечкой","выпечкою","выпечками","выпечке","выпечках",
	"булка","булки","булок","булке","булкам","булку","булкой","булкою","булками","булке","булках",
	"булочка","булочки","булочек","булочке","булочкам","булочку","булочкой","булочкою","булочками","булочке","булочках",
	"блин","блины","блина","блинов","блину","блинам","блином","блинами","блине","блинах",
	"оладьи", "оладья","оладий","оладье","оладьям","оладью","оладьей","оладьею","оладьями","оладьях",
	"пицца","пиццы","пицц","пицце","пиццам","пиццу","пиццей","пиццею","пиццами","пиццах",
	"маффин","маффины","маффина","маффинов","маффину","маффинам","маффином","маффинами","маффине","маффинах",
	"хлеб","хлебы","хлеба","хлебов","хлебу","хлебами","хлебам","хлебом","хлебе","хлебах",
	"брауни",
	"пирог", "пироги", "пирога", "пирогу", "пирогами", "пирогах",
	"бутерброд", "бутерброды", "бутерброда", "бутерброду", "бутербродами", "бутербродах",


	//блюда
	"бургер","бургеры","бургера","бургеров","бургеру","бургерам","бургером","бургерами","бургере","бургерах",
	"запеканка","запеканки","запеканок","запеканке","запеканкам","запеканку","запеканкой","запеканкою","запеканками","запеканке","запеканках",
	"суп","супы","супа","супов","супу","супам","супом","супами","супе","супах",
	"борщ","борщи","борща","борщей","борщу","борщам","борщом","борщами","борще","борщах",
	"щи","щей","щам","щами","щах",
	"суп", "супы", "супа", "супу","супом", "супах",
	"пельмени", "пельмени", "пельменя", "пельменю", "пельмени", "пельменями", "пельменях",
	"голубцы","голубца", "голубцу", "голубцы", "голубцами", "голубцах",
	"каша", "каши", "каше", "кашу", "кашей", "кашах",
	"паста", "пасты", "пасту", "пасте", "пасту", "пастой", "пастах",
	"салат", "салаты", "салата", "салату","салатами", "салатах",
	"котлета", "котлеты", "котлете", "котлету", "котлетами", "котлетах",
	"борщ", "борщи", "борща", "борщу", "борщем", "борщах",
	"омлет", "омлеты", "омлета", "омлету","омлетом", "омлетах",

	"sardines",
	"sardine",
	"almond",
	"tuna",
	"roll",
	"bacon",
	"beans",
	"bagels",
	"bbq",
	"bisque",
	"broccoli",
	"buritto",
	"cabbage",
	"cake",
	"chicken",
	"chips",
	"cookies",
	"corn",
	'crab',
	'curry', 
	'cereal', 
	'duck', 
	'donut', 
	'sushi', 
	'toast', 
	'garlic', 
	'ginger', 
	'goose', 
	'grapes', 
	'cracker', 
	'ham', 
	'hamburger', 
	'cheeseburger', 
	'honey', 
	'stew', 
	'jam', 
	'jalapeño', 
	'ketchup', 
	'kidney', 
	'kingfish', 
	'lobster', 
	'lamb', 
	'lasagna', 
	'meatballs', 
	'pepperoni', 
	'spinach', 
	'spaghetti', 
	'walnuts', 
	'walnut', 
	'yogurt', 
	"cakes",
	"orange", "oranges",
	"strawberry", "strawberries",
	"pear", "pears",
	"grape", "grapes",
	"watermelon", "watermelons",
	"kiwi", "kiwis",
	"peach", "peaches",
	"lemon", "lemons",
	"lime", "limes",
	"blueberry", "blueberries",
	"pineapple", "pineapples",
	"apricot", "apricots",
	"plum", "plums",
	"grapefruit", "grapefruits",
	"pomegranate", "pomegranates",
	"melon", "melons",
	"strawberries", "strawberry",
	"raspberries", "raspberry",
	"blackberry", "blackberries",
	"kiwi", "kiwis",
	"cantaloupe", "cantaloupes",
	"nectarine", "nectarines",
	"tangerine", "tangerines",
	"fig", "figs",
	"lime", "limes",
	"coconut", "coconuts",
	"carrot", "carrots",
	"lettuce", "lettuces",
	"pepper", "peppers",
	"onion", "onions",
	"pea", "peas",
	"bean", "beans",
	"broccoli", "broccolis",
	"zucchini", "zucchinis",
	"spinach", "spinachs",
	"garlic", "garlics",
	"squash", "squashes",
	"cabbage", "cabbages",
	"celery", "celeries",
	"eggplant", "eggplants",
	"mushroom", "mushrooms",
	"asparagus", "asparaguses",
	"artichoke", "artichokes",
	"pepper", "peppers",
	"corn", "corns",
	"radish", "radishes",
	"green bean", "green beans",
	"brussels sprout", "brussels sprouts",
	"cauliflower", "cauliflowers",
	"beet", "beets",
	"leek", "leeks",
	"parsnip", "parsnips",
	"lemon", "lemons",
	"pomelo", "pomelos",
	"plantain", "plantains",
	"kale", "kales",
	"guava", "guavas",
	"locust", "locusts",
	"kumquat", "kumquats",
	"radicchio", "radicchios",
	"endive", "endives",
	"beef",
]
const foodDescription = [
	"аппетитно",
	"вкусно",
	"сочно",
	"ароматно",
	"нежно",
	"сладко",
	"остро",
	"горько",
	"сладенько",
	"пряно",
	"смачно",
	"сладостно",
	"жирно",
	"горьковато",
	"пресно",
	"изысканно",
]
const foodQuestions = [
	"Что ты думаешь о вегетарианской диете?",
	"Как ты относишься к фаст-фуду?",
	"Какую еду ты считаешь самой полезной?",
	"Какой у тебя любимый десерт?",
	"Как ты относишься к французской кухне?",
	"Что для тебя важнее - вкус еды или ее калорийность?",
	"Какую еду ты считаешь самой вредной для здоровья?",
	"Что ты думаешь о современных трендах в питании?",
	"Есть ли у тебя аллергия на какие-либо продукты?",
	"Какой продукт ты терпеть не можешь?",
	"Что для тебя важнее - внешний вид блюда или его вкус?",
	"Ты любишь попробовать новые блюда или предпочитаешь знакомые рецепты?",
	"Какое блюдо у тебя ассоциируется с детством?",
	"Ты пробовал бы блюдо, которое считается деликатесом, но для тебя кажется необычным или странным?",
	"Какое блюдо тебе хочется попробовать, но еще не удалось?"
]
// //описание еды, реакции и вопросы
const spiceNames = [
	"пряность","пряности","пряностей","пряностям","пряностью","пряностями","пряностях",
	"специя","специи","специй","специям","специю","специей","специею","специями","специях",
	"приправа","приправы","приправ","приправе","приправам","приправу","приправой","приправою","приправами","приправах",
	"сахар","сахара","сахару","сахаром","сахаре",
	"соль","соли","солей","солям","солью","солями","солях",
	"перец","перцы","перца","перцев","перцу","перцам","перцем","перцами","перце","перцах",
	"корица","корицы","кориц","корице","корицам","корицу","корицей","корицею","корицами","корицах",
	"чили",
	"бадьян","бадьяны","бадьяна","бадьянов","бадьяну","бадьянам","бадьяном","бадьянами","бадьяне","бадьянах",
	"укроп","укропы","укропа","укропов","укропу","укропам","укропом","укропами","укропе","укропах",
]
// //названия специй
const drinksWords = [
	"напиток","напитки","напитка","напитков","напитку","напиткам","напитком","напитками","напитке","напитках",
	"выпивка","выпивки","выпивок","выпивке","выпивкам","выпивку","выпивкой","выпивкою","выпивками","выпивке","выпивках",
	"вода","воды","вод","воде","водам","воду","водой","водою","водами","водах",

]
const drinksNames = [
	"чай","чаи","чая","чаев","чаю","чаям","чаем","чаями","чаях",
	"кофе","кофей","кофий","кофейя","кофеин",
	"тархун","тархуны","тархуна","тархунов","тархуну","тархунам","тархуном","тархунами","тархуне","тархунах",
	"квас","квасы","кваса","квасов","квасу","квасам","квасом","квасами","квасе","квасах",
	"сок","соки","сока","соков","соку","сокам","соком","соками","соке","соках",
	"молоко","молока","молоку","молоком","молоке",
	"кола","колы","коле","колам","колу","колы","колой","колою","колами","коле","колах",
	"газировка","газировки","газировок","газировке","газировкам","газировку","газировкой","газировкою","газировками","газировке","газировках",
	"коктейль","коктейли","коктейля","коктейлей","коктейлю","коктейлям","коктейлем","коктейлями","коктейле","коктейлях",
]
const drinksDescription = [
	"сладко",
	"кисло",
	"горько",
	"крепко",
	"мягко",
	"ярко",
	"сочно",
	"пикантно",
	"нежно",
	"пряно",
	"освежающе",
	"жгуче",
	"газировано",
]
const drinksBadNames = [
	"бухло","бухла","бухлу","бухлом","бухле",
	"алкоголь","алкоголи","алкоголя","алкоголей","алкоголю","алкоголям","алкоголем","алкоголями","алкоголе","алкоголях",
	"спирт","спирты","спирта","спиртов","спирту","спиртами","спиртом","спирте","спиртах",
	"водка","водки","водок","водке","водкам","водку","водкой","водкою","водками","водках",
	"пиво","пива","пиву","пивом","пиве",
	"вино","вина","вин","вину","винам","вином","винами","вине","винах",
	"коньяк","коньяки","коньяка","коньяков","коньяку","коньякам","коньяком","коньяками","коньяке","коньяках",
]
const drinksQuestions = [
	"Какой напиток ты пьешь чаще всего?",
	"Ты пьешь кофе или чай чаще?",
	"Пьешь энергетики?",
	"Какой напиток ты предпочитаешь летом?",
	"Как относишься к диетическим напиткам?",
	"Как относишься к традиционным русским напиткам, типа кваса или медовухи?",
	"Пьешь ли ты соки?",
	"Как относишься к напиткам с добавлением кофеина?",
	"Пьешь ли ты часто минеральную воду?",
	"Как относишься к кислым напиткам, типа лимонадов?",
	"Ты пьешь чай с добавлением молока и сахара?",
	"Предпочитаешь крепкий кофе или легкий латте?",
	"Пьешь ли ты когда-нибудь напитки с травами?",
	"Пьешь ли ты часто газировку?",
	"Ты пьешь кофе черный или предпочитаешь с молоком?",
	"Как относишься к напиткам с добавлением меда?",
	"Предпочитаешь горячие или холодные напитки?"

]
// //описание напитков
const animalWords = [

	//животные
	"животное","животные","животного","животных","животному","животным","животным","животными","животном",
	"пес","псы","пса","псов","псу","псам","псом","псами","псе","псах",
	"собака","собаки","собак","собаке","собакам","собаку","собакой","собакою","собаками","собаке","собаках",
	"щенок","щенки","щенята","щенка","щенков","щенят","щенку","щенкам","щенятам","щенком","щенками","щенятами","щенке","щенках","щенятах",
	"олень","олени","оленя","оленей","оленю","оленям","оленями","олене","оленях",

	//птицы
	"птица","птицы","птиц","птице","птицам","птицу","птицей","птицею","птицами","птицах",
	"петух","петухи","петуха","петухов","петуху","петухам","петухов","петухом","петухами","петухе","петухах",

	"cat",
	"cats",
	"elephant",
	"elephants",
	"lion",
	"lions",
	"tiger",
	"tigers",
	"giraffe",
	"giraffes",
	"monkey",
	"monkeys",
	"bear",
	"bears",
	"penguin",
	"penguins",
	"zebra",
	"zebras",
	"dolphin",
	"dolphins",
	"squirrel",
	"squirrels",
	"rabbit",
	"rabbits",
	"owl",
	"owls",
	"horse",
	"horses",
	"cow",
	"cows",
	"sheep",
	"sheep",
	"pig",
	"pigs",
	"chicken",
	"chickens",
	"duck",
	"ducks",
	"goat",
	"goats",
	"deer",
	"deer",
	"fox",
	"foxes",
	"wolf",
	"wolves",
	"rhinoceros",
	"rhinoceroses",
	"whale",
	"whales",
	"dolphin",
	"dolphins",
	"shark",
	"sharks",
	"octopus",
	"octopuses",
	"seal",
	"seals",
	"polar bear",
	"polar bears",
	"kangaroo",
	"kangaroos",
	"hippopotamus",
	"hippopotamuses",
	"crocodile",
	"crocodiles",
	"platypus",
	"platypuses",
	"koala",
	"koalas",
	"sloth",
	"sloths",
	"chameleon",
	"chameleons",
	"lizard",
	"lizards",
	"camel",
	"camels",
	"bat",
	"bats",
	"parrot",
	"parrots",
	"panda",
	"pandas",
	"jaguar",
	"jaguars",
	"hamster",
	"hamsters",
	"hedgehog",
	"hedgehogs",
	"crow",
	"crows",
	"eagle",
	"eagles",
	"falcon",
	"falcons",
	"gazelle",
	"gazelles",
	"jaguarundi",
	"jaguarundis",
	"mongoose",
	"mongooses",
	"otter",
	"otters",
	"puma",
	"pumas",
	"red panda",
	"red pandas",
	"turtle",
	"turtles",
	"walrus",
	"walruses",
	"whale shark",
	"whale sharks",
	"yak",
	"yaks",
	"blue jay",
	"blue jays",
	"crab",
	"crabs",
]
const animalDescription = [
	"грациозно",
	"храбро",
	"жадно",
	"лениво",
	"игриво",
	"мило",
	"спокойно",
	"объемисто",
	"проникновенно",
	"хитро",
	"застенчиво",
	"горделиво",
	"беспокойно",
	"доброжелательно",
	"бесстрашно",
	"выразительно",
	"элегантно",
	"яростно",
	"по-братски",
	"весело",
]
const animalQuestions = [
	"Как называется самое ядовитое животное на планете?",
	"Какой группы животных не существует на Антарктиде?",
	"Какую цветовую гамму видят пчелы?",
	"Какой вес является рекордным для слона?",
	"Какое животное не способно вырабатывать собственную температуру?",
	"В каком месте тела у паука находятся его легкие?",
	"Какого цвета кровь у голубей?",
	"Сколько желудков у коровы?",
	"Какие животные спят больше всего на свете?",
	"Сколько челюстей у пчелы?",
	"Какого цвета язык у жирафов?",
	"Сколько зубов у дельфина?",
	"Какие животные не спят во время зимней спячки?",
]
// //описание животных
const natureWords = [
	"камень","камни","камня","камней","камню","камням","камнем","камнями","камне","камнях",
	"дерево","деревья","дерева","деревьев","дереву","деревьям","деревом","деревьями","дереве","деревьях",
	"солнце","солнца","солнц","солнцу","солнцам","солнцем","солнцами","солнцах",
	"река","реки","рек","реке","рекам","реку","рекой","рекою","реками","реках",
	"гора","горы","гор","горе","горам","гору","горой","горою","горами","горах",

	"clouds",
	"rain",
	"wind",
	"flower",
	"forest",
	"field",
	"lake",
	"sky",
	"grass",
	"sand",
	"dune",
	"valley",
	"canyon",
	"waterfall",
	"meadow",
	"desert",
	"island",
	"volcano",
	"tundra",
	"bamboo",
	"delta",
	"glacier",
	"lagoon",
	"reef",
	"cave",
	"plateau",
	"marsh",
	"pond",
	"summit",
	"rift",
	"fjord",
	"delta",
	"gulf",
	"savanna",
	"estuary",
	"cliff",
	"ridge",
	"stream",
	"hill",
	"bay",
	"quarry",
	"heath",
	"swamp",
	"ravine",
	"oasis",
	"crater",
	"basin",
	"promontory",
	"dell",
	"crag",
	"grove",
	"floodplain",
	"foothill",
	"quagmire",
	"arctic",
	"bush",
	"gorge",
	"fen",
	"knoll",
	"pinnacle",
	"escarpment",
	"alluvial",
	"estuary",
	"upland",
	"taiga",
	"saltmarsh",
	"crag",
	"tableland",
	"trellick",
	"wetland",
	"canyon",
	"wadi",
	"rainforest",
	"mesa",
	"prairie",
	"tropics",
	"arroyo",
	"bight",
	"trial",
	"cape",
	"isthmus",
	"moor",
	"foreland",
	"corrie",
	"polynya",
	"pocosin",
	"lava",
	"pebble",
	"gully"
]
const natureDescription = [
	'живописно',
	'красиво',
	'ярко',
	'тихо',
	'шумно',
	'величественно',
	'гармонично',
	'дико',
	'безмятежно',
	'вдохновенно',
	'колоссально',
	'монументально',
	'ослепительно',
	'пленительно',
	'потрясающе',
]
const natureQuestions = [
	"Почему пустынные розы не пахнут?",
	"Как крокусы знают, когда цветок поднимается к солнцу?",
	"Могут ли растения плакать?",
	"Почему характерный запах после дождя так приятен?",
	"Какое животное способно выделять свет во тьме?",
	"Существует ли растение, которое может перемещаться?",
	"Каким образом растения общаются между собой?",
	"Может ли дерево видеть вокруг себя?",
	"Почему листья меняют цвет осенью?",
	"Какие растения способны противостоять магнитным полям?",
	"Как листья могут защищаться от вредителей без химических веществ?",
	"Существует ли растение, которое может вылечить заболевания человека?",
	"Какое животное может пережить абсолютный ноль?",
	"Почему тропические растения так разнообразны?",
	"Может ли растение чувствовать боль?",
	"Почему звуки в природе могут быть такими успокаивающими?",
	"Какие секреты хранит морская глубина?",
	"Может ли камень испытывать чувства?",
	"Почему существуют однолетние растения?",
	"Как животные могут предсказывать приближение непогоды?",
	"Существует ли растение, которое не нуждается в воде?",
	"Почему весенние цветы появляются после снегопада?",
	"Какую тайну скрывает запах свежей травы?",
	"Могут ли растения чувствовать эмоции?",
	"Почему редкие растения обитают в особо суровых условиях?",
	"Какие необычные способности есть у древесины?",
	"Может ли камыш расправиться сам по себе?",
	"Почему деревья могут создавать музыку при ветре?",
	"Какие тайны хранит морская пена?",
	"Могут ли растения обмениваться информацией во сне?",
	"Почему некоторые растения находятся под защитой закона?",
	"Каким образом растения выбирают своего опылителя?",
	"Может ли красное море стать снова красным?",
	"Почему некоторые растения растут только на определенной высоте?",
	"Существует ли растение, которое может укреплять почву?",
	"Какие секреты хранят деревья старше тысячи лет?",
	"Могут ли животные разговаривать с растениями?",
	"Почему водопады имеют такое успокаивающее действие?",
	"Каким образом растения могут защищаться от радиации?",
	"Может ли планета земля чувствовать человеческие эмоции?",
	"Почему некоторые растения способны питаться на солнечном свете?",
	"Каким образом земля плодородна и образует новую жизнь?",
	"Существует ли растение, которое может предсказать землетрясения?",
	"Почему некоторые растения выживают в условиях высокой температуры?",
]
const natureNames = [
	"природа","природы","природ","природе","природам","природу","природой","природою","природами","природах",
	"мир","миры","мира","миров","миру","мирам","миром","мирами","мире","мирах",
	"естество","естества","естеству","естеством","естестве",
	"растенье","растенья","растений","растенью","растеньями","растеньям","растеньем","растеньях",
]
// //описание природы
const musicGenres = [
	"рок", "рока", "року", "роком", "роке",
	"поп", "попа", "попу", "попом", "попе",
	"джаз", "джаза", "джазу", "джазом", "джазе",
	"классика", "классики", "классике", "классику", "классикой",
	"ран", "рана", "рану", "раном", "ране",
	"метал", "метала", "металу", "металом", "метале",
	"электроника", "электроники", "электронике", "электронику", "электроникой",
	"панк", "панка", "панку", "панком", "панке",
	"блюз", "блюза", "блюзу", "блюзом", "блюзе",
	"регги",
	"ска",
	"фолк", "фолка", "фолку", "фолком", "фолке",
	"инди",
	"диско",
	"кантри",
	"реггетон", "реггетона", "реггетону", "реггетоном", "реггетоне",
	"рэп", "рэпа", "рэпу", "рэпом"," рэпе",
	"реп", "репа", "репу", "репом"," репе",
	"гранж", "гранжа", "гранжу", "гранжем", "гранже",
	"индастриал", "индастриала", "индастриалу", "индастриалом", "индастриале",
	"панк", "панка", "панку", "панком", "панке",
	"музыка", "музыки", "музыке", "музыку", "музыкой",
	"транс", "транса", "трансу", "трансом", "трансе",
	"лича", "личи", "личу", "личым", "личе",
	"хаус", "хауса", "хаусу", "хаусом", "хаусе",
	"прогрессив", "прогрессива", "прогрессиву", "прогрессивом", "прогрессиве",
	"мэйнстрим", "мэйнстрима", "мэйнстриму", "мэйнстримом", "мэйнстриме",
	"альтернатива", "альтернативы", "альтернативе", "альтернативу", "альтернативой",
	"диско",
	"техно", 
	"шансон", "шансона", "шансону", "шансоном", "шансоне",
	"эмбиент", "эмбиента", "эмбиенту", "эмбиентом", "эмбиенте",
	"соул", "соула", "соулу", "соулом", "соуле",
	"джунглист", "джунглиста", "джунглисту", "джунглистом", "джунглисте",
	"басс", "басса", "бассу", "бассом", "бассе",
	"фьюжн", "фьюжна", "фьюжну", "фьюжном", "фьюжне",
	"готика", "готики", "готике", "готику", "готикой",
	"диссонанс", "диссонанса", "диссонансу", "диссонансом", "диссонансе",
	"дабстеп", "дабстепа", "дабстепу", "дабстепом", "дабстепе",
	"рейв", "рейва", "рейву", "рейвом", "рейве",
	"трип",
	"нойз",
	"реггафьюжн", "реггафьюжна", "реггафьюжну", "реггафьюжном", "реггафьюжне",
	"эмо",

	"alternative",
	"blues",
	"country",
	"dance",
	"electronic",
	"folk",
	"gospel",
	"hiphop",
	"indie",
	"jazz",
	"kpop",
	"metal",
	"newwave",
	"opera",
	"pop",
	"rap",
	"reggae",
	"salsa",
	"techno",
	"underground",
	"vocal",
	"world",
	"xylophone",
	"zydeco",
	"classical",
	"disco",
	"funk",
	"garage",
	"hardrock",
	"instrumental",
	"jungle",
	"klezmer",
	"motown",
	"orchestral",
	"punk",
	"raggaeton",
	"samba",
	"triphop",
	"urban",
	"waltz",
	"yodeling",
	"zydeco",
	"ambient",
	"breakbeat",
	"cabaret",
	"deathmetal",
	"emo",
	"fusion",
	"grunge",
	"heavymetal",
	"industrial",
	"jpop",
	"krishnacore",
	"lounge",
	"mambo",
	"nujazz",
	"psychedelic",
	"rockabilly",
	"spacerock",
	"tango",
	"trance",
	"vaporwave",
	"yéyé",
	"zouk",
	"afrobeat",
	"bhangra",
	"celtic",
	"doommetal",
	"electroswing",
	"fado",
	"grime",
	"hardcore",
	"italodisco",
	"jive",
	"kwaito",
	"lambada",
	"mathrock",
	"neosoul",
	"oi",
	"quartet",
	"rumba",
	"ska",
	"thrashmetal",
	"vikingmetal",
	"xtrabass",
	"zumba",
	"rock",
	"hyperpop",
	"chanson",
]
// import { musicDescription as musicDescription } from "./js/categories.js";
const musicDescription = [
	"мелодично",
	"ритмично",
	"гармонично",
	"эмоционально",
	"ярко",
	"динамично",
	"мощно",
	"зажигательно",
	"легко",
	"виртуозно",
	"нежно",
	"сильно",
	"трогательно",
	"красиво",
	"увлекательно",
	"величественно",
	"круто",
	"меланхолично",
	"печально",
	"органично",
	"смело",
	"радостно",
	"умеренно",
	"непринуждённо",
	"классно",
	"точно",
	"завораживающе",
]
const musicQuestions = [
	"Какую музыку ты обычно слушаешь?",
	"Какое твое любимое музыкальное направление?",
	"Есть ли у тебя любимая группа или исполнитель?",
	"Сколько времени в день ты тратишь на прослушивание музыки?",
	"Какой альбом тебе нравится больше всего?",
	"Какую роль играет музыка в твоей жизни?",
	"Тебе нравится музыкальный театр?",
	"Как ты относишься к ремиксам?",
	"Какая музыка помогает тебе сконцентрироваться?",
	"Сколько раз ты был на концертах?",
	"Какие музыкальные группы тебе не нравятся?",
	"Какую музыку ты предпочитаешь слушать в дороге?",
	"Какую музыку ты слушаешь, когда тебе нужно успокоиться?",
	"Как часто ты слушаешь музыку на кухне?",
	"Какие музыкальные жанры ты считаешь необычными?",
	"Какую песню ты слушал последней?",
	"Какую музыку ты предпочитаешь слушать, когда тебе нужно вдохновиться?",
	"Какие музыкальные инструменты тебе кажутся самыми красивыми?",
	"Как часто ты поешь в душе?",
	"Какую музыку ты слушаешь, когда тебе нужно получить заряд бодрости?",
	"Какую музыку ты сйчас слушаешь?",
	"А ты еще играешь на гитаре или сдулся?",
	"Что для тебя является главным критерием для хорошей музыки?",
	"Какую песню ты чаще всего слушаешь в последнее время?",
	"Тебе нравится читать реп?",
	"Как ты относишься к музыкальным наградам и премиям?",
	"Как ты относишься к музыкальным каверам?",
	"Какую песню ты бы исполнил на караоке, а?",
	"Слушаешь французский реп?",
	"Тебе интересно изучать историю музыкальных жанров?",
	"Как ты относишься к музыкальной индустрии и коммерции в музыке?",
	"Каким исполнителем ты мог бы стать, если бы у тебя был талант?",
	"Сколько времени ты ежедневно слушаешь музыку?",
	"Ты предпочитаешь живые выступления или записанные треки?",
]
const musicWord = [
	"музыка","музыки","музык","музыке","музыкам","музыку","музыкой","музыкою","музыками","музыках",
	"композиция","композиции","композиций","композициям","композицию","композицией","композицею","композициями","композициях",
	"песня","песни","песен","песне","песням","песню","песней","песнею","песнями","песнях",
	"трек","треки","трека","треков","треку","трекам","треком","треками","треке","треках",
]
// //музыкальные жанры и реакция на них
const langNames = [
	"english", "английский","английское","английская","английские","английского","английской","английских","английскому","английским","английскую","английскою","английском","английски",
	"чеченски","чеченский","чеченском",
	"французский","французски","французском",
	"шведски","шведский","шведском",
	"арабски","арабский","арабском",
	"немецкий","немецки","немецком",
	"литовски","литовский","литовском",
	"латышски","латышский","латышском",
	"японски","японский","японском",
	"корейски","корейский","корейском",
	"китайский","китайски","китайском",
	"spanish", 
	"french", 
	"german", 
	"chinese", 
	"arabic", 
	"hindi", 
	"portuguese", 
	"japanese", 
	"italian", 
	"korean", 
	"turkish", 
	"dutch", 
	"polish", 
	"swedish", 
	"vietnamese", 
	"indonesian", 
	"greek", 
	"thai", 
	"finnish", 
	"hebrew", 
	"czech", 
	"norwegian", 
	"danish", 
	"hungarian", 
	"romanian", 
	"ukrainian", 
	"bulgarian", 
	"croatian", 
	"slovak", 
	"serbian", 
	"malay", 
	"kurdish", 
	"bengali", 
	"tagalog", 
	"urdu", 
	"lithuanian", 
	"latvian", 
	"estonian", 
	"georgian", 
	"armenian",
	"icelandic", 
	"mongolian", 
	"sinhala", 
	"tamil", 
	"telugu", 
	"kannada", 
	"gujarati", 
	"marathi", 
	"punjabi", 
	"burmese", 
	"khmer", 
	"maltese", 
	"macedonian", 
	"albanian", 
	"bosnian", 
	"slovenian", 
	"kazakh", 
	"turkmen", 
	"azerbaijani", 
	"uzbek", 
	"tajik", 
	"moldovan", 
	"kyrghyz", 
	"tibetan", 
	"nepali", 
	"tibetan", 
	"aymara", 
	"quechua", 
	"guarani", 
	"fijian", 
	"tongan", 
	"samoan", 
	"maori", 
	"bislama", 
	"marshallese", 
	"palauan", 
	"yapese", 
	"chamorro", 
	"chuukese", 
	"kiribati", 
	"nauruan", 
	"tuvaluan", 
	"tokelauan", 
	"niuean", 
	"tahitian", 
	"rapanui", 
	"rarotongan", 
	"pitkern", 
	"hawaiian", 
	"flemish",
	"сhechen",
	"чеченский",
	
]
const langRussian = [
	"русский","русское","русская","русские",
	"русского","русской","русских",
	"русскому","русским","русскую",
	"русскою","русскими","русском",
	"русски",
	"russian","рашн","рашен",
]
// //языки и лингвистика
const movieTitles = [
	"Крестный отец",
	"Побег из Шоушенка",
	"Криминальное чтиво",
	"Темный рыцарь",
	"Форрест Гамп",
	"Титаник",
	"Бойцовский клуб",
	"Молчание ягнят",
	"Властелин колец",
	"Гладиатор",
	"Парк Юрского периода",
	"Зеленая миля",
	"Король Лев",
	"Мстители",
	"Аватар",
	"Бесславные ублюдки",
	"Выживший",
	"Джанго освобожденный",
	"Интерстеллар",
	"Крестный отец, часть 2",
	"Социальная сеть",
	"Волк с Уолл-стрит",
	"Бесславные ублюдки",
	"Безумный Макс: Дорога ярости",
	"Город Бога",
	"Отель Гранд Будапешт",
	"Терминатор",
	"Вечное сияние чистого разума",
	"Шестое чувство",
	"Рокки",
	"Американская красота",
	"Шоу Трумана",
	"Спасение рядового Райана",
	"Темный рыцарь",
	"Сияние",
	"Индиана Джонс и последний крестовый поход",
	"Челюсти",
	"Лицо со шрамом",
	"Большой Лебовски",
	"Парк Юрского периода",
	"Престиж",
	"Зеленая миля",
	"Матрица",
	"Дюнкерк",
	"Звездные войны",
	"Славные парни",
	"Список Шиндлера",
	"Властелин колец",
	"Храброе сердце",
]
const movieWords = [
	"movie","movies",
	"film","films",
	"cinema","cinemas",
	"кино","cinéma",
	"фильм","фильмы","фильма","фильмов","фильму","фильмам","фильмом","фильмами","фильме","фильмах",
]
const movieMessages = [
	"Как Даррен Аронофски использует камеру и свет для создания атмосферы?",
	"Какая роль звука в фильмах Мишеля Гондри и Кристофа Гансе?",
	"Почему Жан-Люк Годар не следует стандартной структуре в артхаусных фильмах?",
	"Зачем Луи Бунюэль вводит странные женские персонажи в свои фильмы?",
	"Зачем делается работа с экспрессионизмом и абстракционизмом в фильмах Лукаса Мудисона и Тима Бертона",
	"А для тебя фильмы Лукаса Мудисона и Майка Ли мутные и бесформенные?",
	"Отличия артхауса от других форм искусства в фильмах Луи Бунюэля и Веры Хитилы?",
	"Чем фильмы Ларса фон Триера и Вонга Кар Вая создают такую чушь?",
]
const directorsNames = [
	"франсуа","озон","озона","озону","озоне","озоном",
	"гаспар","гаспара","гаспару","р=гаспаром","гаспаре","ноэ",
	"ксавье","долан",
	"аронофски","даррен","даренна","даренну","дарроном","дарране",
	"гансе","гондри",
	"годар","годара","годару","годаром","годаре",
	"бунюэль",
	"хитила","хитилой","хитиле","хитилою","хитиломи","хитилы",
	"мудисон","мудисона","мудисону","мудисоном","мудисоне",
	"триер","триера","триеру","триером","триере",
	"вай","вая","ваю","ваем",
	"тарантино",
	"спилберг","спилбергом","спилберга","спилбергу","спилберге",
]
// //кино
const sportWords = [
	"спорт","спорта","спорту","спортом","спорте",
	"футбол","футбола","футболу","футболом","футболе",
	"баскетбол","баскетбола","баскетболу","баскетболом","баскетболе",
	"бокс","бокса","боксу","боксом","боксе",
	"волейбол","волейбола","волейболу","волейболом","волейболе",
	"теннис","тенниса","теннису","теннисом","теннисе",
	"гольф","гольфа","гольфу","гольфом","гольфе",
	"боулинг","боулинга","боулингу","боулингом","боулинге",
]
// //спорт

// //ОТДЕЛЬНЫЕ ГЛАГОЛЫ
const verbLove = [
	"любить","люблю","любил","любила","любишь","люби","любит","любил","любила","любило","любим","любили","любите","любили","любят","любящий","любивший",
	"нравиться","нравлюсь","нравился","нравилась","нравишься","нравься","нравится","нравилось","нравимся","нравились","нравитесь","нравьтесь","нравятся","нравящийся","нравившийся","нравясь",
	"обожать","обожаю","обожала","обожаешь","обожал","обожала","обожай","обожает","обожало","обожаем","обожали","обожаете","обожайте","обожают","обожающий","обожавший",
]
// //глагол любить, нравится и тд
const verbName = [
	"звать","зовут","зову","звал","звала","зовешь","зови","зовет","звало","зовем","звали","зовете","зовите","зовущий","звавший","зовя",
	"именовать","именую","именовал","именовала","именуешь","именуй","именует","именовало","именуем","именовали","именуете","именуйте","именуют","именующий","именовавший",
	"называть","называю","называл","назвал","называла","назвала","назвали","назвало","назвали","называешь","называй","называет","называло","называем","называли","называете","называйте","называют","называющий","называвший","назову","назови",
	"величать","величаю","величал","величала","величало","величаешь","величай","величает","величаем","величали","величаете","величали","величайте","величают","величали","величающий","величавший",
	"имя","имена","имени","имен","имени","именам","именем","именами","именах",
	"ник","ники","ника","ников","нику","никам","ником","никами","нике","никах",
	"кличка","клички","кличек","кличку","кличкам","кличке","кличках",
	"перечислять","перечисли","перечисляю","перечислял","перечисляла","перечисляло","перечисляешь","перечисляй","перечисляет","перечисляем","перечисляли","перечисляете","перечисляйте","перечисляют","перечисляя",
]
// //глагол называть, звать + имя
const verbDrink = [
	"пить","пью","пил","пила","пьешь","пей","пьет","пило","пьем","пили","пьете","пейте","пьют","пили","пьющий","пивший",
	"выпивать","выпиваю","выпивал","выпивала","выпивало","выпиваешь","выпивай","выпивает","выпиваем","выпивали","выпиваете","выпивайте","выпивают","выпивающий",
	"бухать","бухаю","бухал","бухала","бухало","бухаешь","бухай","бухает","бухаем","бухали","бухаете","бухайте","бухающий","бухая",
]
// //глагол пить, выпивать
const verbSmoke = [
	"курить","курю","курил","курила","курило","куришь","кури","курит","курим","курили","курите","курили","курят","курящий","куривший","куря","куренный","курив",
	"покурить","покурю","покурил","покурила","покурило","покуришь","покури","покурит","покурим","покурили","покурите","покурили","покурят","покурящий","покуривший","покуря","покуренный","покурив",
	"закурить","закурю","закурил","закурила","закурило","закуришь","закури","закурит","закурим","закурили","закурите","закурили","закурят","закурящий","закуривший","закуря","закуренный","закурив",
	"накурить","накуриваться","накурю","накурил","накурила","накурило","накуришь","накури","накурит","накурим","накурили","накурите","накурили","накурят","накурящий","накуривший","накуря","накуренный","накуреный","накурив",
	"дымить","дымлю","дымил","дымила","дымило","дымышь","дыми","дымит","дымим","дымыли","дымите","дымят","дымящий","дымивший","дымя","дымывши",
	"смолить","смолю","смолил","смолила","смолило","смолишь","смоли","смолит","смолим","смолили","смолите","смолят","смолящий","смоливший","смоля","смолив",
]
// //глагол курить, дымыть
const verbHate = [
	"ненавидеть","ненавижу","ненавидел","ненавидела","ненавидело","ненавидишь","ненавидь","ненавидит","ненавидим","ненавидели","ненавидите","ненавидьте","ненавидят","ненавидели","ненавидящий","ненавидевший","ненавидя",
	"раздражать","раздражаю","раздражал","раздражала","раздражало","раздражаешь","раздражай","раздражает","раздражаем","раздражали","раздражаете","раздражайте","раздражают","раздражающий","раздражавший","раздражая",
	"раздражаться","раздражаюсь","раздражался","раздражалася","раздражалось","раздражаешься","раздражайся","раздражается","раздражаемся","раздражалися","раздражаетесь","раздражайтесь","раздражаются","раздражающийся","раздражавшийся","раздражаясь",
	"бесить","бешу","бесил","бесила","бесило","беси","бесит","бесим","бесили","бесите","бесили","бесят","бесящий","беся","бесивший",	
]
// //глагол ненавидеть, злиться
const verbSpeak = [
	"говорить","говорил","говорила","говоришь","говори","говорит","говорило","говорим","говорили","говорите","говорят","говоря","говорящий",
	"поговорить","поговорил","поговорила","поговоришь","поговори","поговорит","поговорило","поговорим","поговорили","поговорите","поговорят","поговоря","поговорящий",
	"говориться","говорился","говорилася","говоришься","говорись","говорится","говорилось","говоримся","говорились","говоритесь","говорятся","говорясь","говорящийся",
	"договориться","договорился","договорилася","договоришься","договорись","договорится","договорилось","договоримся","договорились","договоритесь","договорятся","договорясь","договорящийся",
	"сказать","скажу","сказал","сказала","сказало","скажешь","скажи","скажет","скажем","сказали","скажем","скажемте","скажете","сказали","скажите","скажут","сказавший","сказав",
	"высказать","выскажу","высказал","высказала","высказало","выскажешь","выскажи","выскажет","выскажем","высказали","выскажем","выскажемте","выскажете","высказали","выскажите","выскажут","высказавший","высказав",
	"рассказать","расскажу","рассказал","рассказала","рассказало","расскажешь","расскажи","расскажет","расскажем","рассказали","расскажем","расскажемте","расскажете","рассказали","расскажите","расскажут","рассказавший","рассказав",
	"произносить","произнес","произнесла","произнесешь","произнесло","произнеси","произнесет","произнесем","произнесли","произнесемте","произнесете","произнесите","произнесут","произнесший","произнеся",
	"беседовать","беседую","беседовал","беседовала","беседовало","беседуешь","беседуй","беседует","беседуем","беседовали","беседуете","беседуйте","беседуют","беседующий","беседуя","беседовавший",
]
// //глагол говорить
const verbLaugh = [
	"ха","хах","хаха","хахах","хахаха","хахахах","хахахаха",
	"аха","ахах","ахаха","ахахах","ахахаха","ахахахах","ахахахаха",
	"xa","xax","xaxa","xaxax","xaxaxa","xaxaxax","xaxaxaxa",
	"axa","axax","axaxa","axaxax","axaxaxa","axaxaxax","axaxaxaxa",
	"смешно","смешной","смешная","смешное","смешные",
	"умора","уморы","умор","уморе","уморам","умору","уморой","уморою","уморами","уморах",

	"смеяться","смеюсь","смеялся","смеялась","смеялось","смеешься","смейся","смеется","смеемся","смеялись","смеетесь","смейтесь","смеются","смеящийся","смеясь",
	"рассмеяться","рассмеюсь","рассмеялся","рассмеялась","рассмеялось","рассмеешься","рассмейся","рассмеется","рассмеемся","рассмеялись","рассмеетесь","рассмейтесь","рассмеются","рассмеящийся","рассмеясь",
	"веселиться","веселюсь","веселился","веселилась","веселилось","веселишься","веселись","веселится","веселимся","веселитесь","веселились","веселятся","веселящийся","веселясь",
	"развеселиться","развеселюсь","развеселился","развеселилась","развеселилось","развеселишься","развеселись","развеселится","развеселимся","развеселитесь","развеселились","развеселятся","развеселящийся","развеселясь",
]
// //глагол смеяться
const verbAsk = [
	"вопрос","вопросы","вопроса","вопросов","вопросу","вопросам","вопросом","вопросами","вопросе","вопросах",
	"спрашивать","спрашиваю","спрашивал","спрашивало","спрашивала","спрашиваешь","спрашивай","спрашивает","спрашиваем","спрашивали","спрашиваете","спрашивайте","спрашивают","спрашивают","спрашивая",
	"расспрашивать","расспрашиваю","расспрашивал","расспрашивало","расспрашивала","расспрашиваешь","расспрашивай","расспрашивает","расспрашиваем","расспрашивали","расспрашиваете","расспрашивайте","расспрашивают","расспрашивают","расспрашивая",
	"спросить","спрошу","спросил","спросила","спросило","спросишь","спроси","спросит","спросим","спросили","спросимте","спросите","спросили","спросят","спросивший","спросив",
	"расспросить","расспрошу","расспросил","расспросила","расспросило","расспросишь","расспроси","расспросит","расспросим","расспросили","расспросимте","расспросите","расспросили","расспросят","расспросивший","расспросив",
]
// //глагол спрашивать
const verbFeelingBad = [
	"грусть","грустно","грустный","грустная","грустное","грустные",
	"печаль","печально","печальный","печальная","печальное","печальные",
	"плохо","плохой","плохая","плохое","плохие",
	"отстой","отстойный","отстойная","отстойное","отстойные",
	"скука","скучно","скучный","скучная","скучное","скучные",
	"херово","херовый","херовая","херовое","херовые",
	"злоба","злобно","злобный","злобная","злобное","злобные",
	"зло","злой","злое","злоя","злые",
	"сердито","сердитый","сердитая","сердитое","сердитые",
	"тоска","тоскливо","тоскливый","тоскливая","тоскливое","тоскливые",

	"злиться","злюсь","злился","злилась","злишься","злилось","злись","злится","злимся","злились","злитесь","злятся","злящийся","злясь",
	"разозлиться","разозлюсь","разозлился","разозлилась","разозлишься","разозлилось","разозлись","разозлится","разозлимся","разозлились","разозлитесь","разозлятся","разозлящийся","разозлясь",
	"разозлить","разозлю","разозлил","разозлила","разозлило","разозлишь","разозли","разозлит","разозлим","разозлили","разозлите","разозлят","разозлящий","разозливший","разозля",

	"сердить","сержу","сердил","сердила","сердишь","сердило","серди","сердит","сердим","сердили","сердите","сердят","сердящий","сердивший","сердя",
	"рассердить","рассержу","рассердил","рассердила","рассердишь","рассердило","рассерди","рассердит","рассердим","рассердили","рассердите","рассердят","рассердящий","рассердивший","рассердя",
	"сердиться","сержусь","сердился","сердилась","сердишься","сердилось","сердись","сердится","сердимся","сердились","сердитесь","сердятся","сердящийся","сердившийся","сердясь",
	"рассердиться","рассержусь","рассердился","рассердилась","рассердишься","рассердилось","рассердись","рассердится","рассердимся","рассердились","рассердитесь","рассердятся","рассердящийся","рассердившийся","рассердясь",
	
	"скучать","скучаю","скучал","скучала","скучало","скучаешь","скучай","скучает","скучаем","скучали","скучаете","скучайте","скучают","скучающий","скучавший","скучая",
	"грустить","грущу","грустил","грустила","грустило","грустишь","грусти","грустит","грустим","грустили","грустите","грустят","грустили","грустящий","грустя",
	"загрустить","загрущу","загрустил","загрустила","загрустило","загрустишь","загрусти","загрустит","загрустим","загрустили","загрустите","загрустят","загрустили","загрустящий","загрустя",
	"печалиться","печалюсь","печалился","печалилось","печалилась","печалься","печалится","печалимся","печалились","печалитесь","печальтесь","печалятся","печалились","печалящийся","печалясь",
	"беситься","бешусь","бесился","бесилась","бесилось","бесись","бесится","бесимся","бесились","беситесь","бесились","бесятся","бесящийся","бесясь","бесившийся",
	"разбеситься","разбешусь","разбесился","разбесилась","разбесилось","разбесись","разбесится","разбесимся","разбесились","разбеситесь","разбесились","разбесятся","разбесящийся","разбесясь","разбесившийся",

]
// //злиться, грустить и тд
const verbThank = [
	"спасибо","пасиба","пасибо","спс","thank","thanks","сенкс","danke","данке","данкэ","мерси","merci","спасибки","пасибки","спасибочки","пасибочки",
	"благо","благодарности","благодарность","благодарствую","признательность",
	"благодарить","благодарю","благодарил","благодарила","благодарило","благодаришь","благодари","благодарит","благодарим","благодарили","благодарите","благодарят","благодарящий","благодаривший","благодаря",
]
// //глагол благодарить
const verbBelieve = [
	"верить","верю","верил","верила","веришь","верило","верь","верит","верим","верили","верите","верили","верьте","верят","верили","верящий","веривший","верив","веривши",
	"поверить","поверю","поверил","поверила","поверишь","поверило","поверь","поверит","поверим","поверили","поверите","поверили","поверьте","поверят","поверили","поверящий","поверивший","поверив","поверивши",
	"веровать","верую","веровал","веровала","веровало","веруй","верует","веруем","веровали","веруете","веруйте","веруют","верующий","веровавший","веруя","веровав","веруемый",
	"молиться","молюсь","молился","молилась","молишься","молись","молится","молилось","молимся","молились","молитесь","молятся","молящийся","молясь",
	"помолиться","помолюсь","помолился","помолилась","помолишься","помолись","помолится","помолилось","помолимся","помолились","помолитесь","помолятся","помолящийся","помолясь",
	"богохульство", "богохульничать","богохульничаю","богохульничал","богохульничала","богохульничало","богохульничаешь","богохульничай","богохульничает","богохульничаем","богохульничали","богохульничаете","богохульничайте","богохульничают","богохульничающий",
	"богохульствовать","богохульствую","богохульствовал","богохульствовала","богохульствовало","богохульствуешь","богохульствуй","богохульствует","богохульствуем","богохульствовали","богохульствуете","богохульствуйте","богохульствуют","богохульствующий","богохульствия",
]
// //глагол верить
const verbEat = [
	"есть","ем","ел","ела","ело","ешь","ест","едим","ели","едите","ешьте","едят",
	"поесть","поем","поел","поела","поело","поешь","поест","поедим","поели","поедите","поешьте","поедят",
	"кушать","кушаю","кушал","кушала","кушало","кушаешь","кушай","кушает","кушаем","кушали","кушаете","кушайте","кушают","кушающий","кушавший","кушая",
	"покушать","покушаю","покушал","покушала","покушало","покушаешь","покушай","покушает","покушаем","покушали","покушаете","покушайте","покушают","покушающий","покушавший","покушая",
	"питаться","питаюсь","питался","питалась","питаешься","питалось","питается","питаемся","питались","питаетесь","питайтесь","питаются","питающийся","питаясь","питавшись",
	"жрать","жру","жрал","жрало","жрала","жрешь","жри","жрет","жрем","жрали","жрите","жрут","жрущий","жравший",
]
// // глагол кушать
const verbKnow = [
	"понимать","понимаю","понимал","понимала","понимало","понимаешь","понимай","понимает","понимаем","понимали","понимаете","понимайте","понимают","понимающий","понимавший","понимая","понял","поняла","поняло",
	"знать","знаю","знал","знала","знало","знаешь","знай","знает","знаем","знали","знаете","знайте","знают","знающий","знавший","зная","знав","знавши",
	"познать","познаю","познал","познала","познало","познаешь","познай","познает","познаем","познали","познаете","познайте","познают","познающий","познавший","позная","познав","познавши",
	"разбираться","разбираюсь","разбирался","разбиралась","разбираешься","разбиралось","разбирайся","разбирись","разбирается","разбираемся","разбирались","разбираетесь","разбирайтесь","разбираются","разбирающийся","разбиравшийся","разбираясь",
	"осозновать","осознаю","осознавал","осознавала","осознавало","осознаешь","осознавай","осознай","осознает","осознаем","осознавали","осознаете","осознавали","осознавайте","осознают","осознающий","осознававший","осознавая",
	"соображать","соображаю","соображал","соображала","соображало","соображаешь","соображай","соображает","соображаем","соображали","соображаете","соображали","соображайте","соображают","соображали","соображающий","соображавший","соображая",
	"догонять","догоняю","догонял","догоняла","догоняло","догоняешь","догоняй","догоняет","догоняем","догоняли","догоняете","догоняйте","догоняют","догоняли","догоняющий","догонявший","догоняя",
]
// //глагол понимать
const verbSorry = [
	"извини","извинение","извинения",
	"извиняться","извиняюсь","извинился","извинялась","извинялось","извиняешься","извиняйся","извиняется","извиняемся","извинялись","извиняетесь","извиняйтесь","извиняются","извинялись","извиняющийся","извинявшийся","извинить",
	"прости","прощение","прощения",
	"прощать","прощаю","прощал","прощала","прощало","прощаешь","прощай","прощает","прощаем","прощали","прощаете","прощайте","прощают","прощая",
	"сори","сорри","sorry",
]
// //глагол извиняться

require("dotenv").config();

const {Bot} = require("grammy");

const bot = new Bot(process.env.BOT_API_KEY);


//ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

	//функция для выведения рандомного числа из длины массива
	function randomArrayNumber(arrayName){
		let lastIndex = arrayName.length;
		const randomNumber = Math.floor(Math.random()*lastIndex);
		return randomNumber;
	}
	//функция делает первую букву ответа заглавной
	function toUpperCaseAnswer(answer){
		return answer.charAt(0).toUpperCase() + answer.slice(1);
	}
	//функция делает первую букву ответа строчной
	function toLowerCaseAnswer(answer){
		return answer.charAt(0).toLowerCase() + answer.slice(1);
	}

//ГЕНЕРАЦИЯ СООБЩЕНИЯ ЧАТ БОТА: ИЗВИЛИНЫ

	//функция формирования мнения по определенной тематике
	function processTopics(topic, description, question){

		let answers = [
				`Говоря про ${topic}, звучит ${description} для меня`,
				`${topic}? Ну так, вполне ${description} на мой вкус. ${question}`,
				`${topic}! Весьма ${description}, я бы сказал. ${question}`,
				`О, ты сказал ${topic}. Одно слово приходит на ум: ${description}`,
				`Слишком ${description}, честно говоря`,
				`${description} на мой взгляд`,
				`Довольно ${description} для меня`,
				`Что, ${topic}? Это ${description}. ${question}`,
			]
	
		let answer = answers[randomArrayNumber(answers)];
		return answer;
		}

	//функция для выражения мнения про кино
	function discussingMovies(movie){

	let answers = [
		`Хмм, по мне так ${movie} - это крутой фильм.`,
		`Скажу честно, ${movie} - вот этот фильм было интересно смотреть`,
		`Мне кажется, ${movie} заслуживает всех наград киноакадемии.`,
	]

	let answer = answers[randomArrayNumber(answers)];
	return answer;
	}


	function processMessage(msg){

		//ФИЛЬТР ДЛЯ СООБЩЕНИЯ ПОЛЬЗОВАТЕЛЯ
	
		let marks = /[,.!?'-\s]+/; 
		// параметр, который фильтрует знаки через regexp
		let yo = /ё/g;
		//параметр для фильтра буквы ё, g - небоходимый флаг для global, берет все элементы, а не только первый
	
		let message = msg.toLowerCase().replaceAll(yo, "е").split(marks); 
		//создает массив из сообщения
		
		//ТОЧКИ СОПРИКОСНОВЕНИЯ, СОВПАДЕНИЯ С ИЗВЕСТНЫМИ ДАННЫМИ
	
		//личный счёт
		const youMatch = youWords.filter(element => message.includes(element));
		const youPossessiveMatch = youPossessiveWords.filter(element => message.includes(element));
		const meMatch = meWords.filter(element => message.includes(element));
		const mePossessMatch = mePossessWords.filter(element => message.includes(element));
	
		//оскорбления, старость,грубость	
		const negativeMatch = negativeWords.filter(element => message.includes(element));
		const rudeMatch = rudeWords.filter(element => message.includes(element));
	
		//приветствие и прощание
		const greetingsMatch = greetingsWords.filter(element => message.includes(element));
	
		//реакция на имена
		const unknownNameMatch = unknownNames.filter(element => message.includes(element));
		const mishaMatch = misha.filter(element => message.includes(element));
		const alexMatch = alex.filter(element => message.includes(element));
		const tommyMatch = thomas.filter(element => message.includes(element));
		const losCallingMatch = losCallingWords.filter(element => message.includes(element));
		const sysaMatch = sysa.filter(element => message.includes(element));
		const duncanMatch = duncan.filter(element => message.includes(element));
		const godMatch = godWords.filter(element => message.includes(element));
		const familyMatch = family.filter(element => message.includes(element));
		const fatherMatch = father.filter(element => message.includes(element));
		const motherMatch = mother.filter(element => message.includes(element));
	
		//категории познаний
		const foodWordsMatch = foodWords.filter(element => message.includes(element));
		const foodMatch = foodNames.filter(element => message.includes(element));
		const drinksWordsMatch = drinksWords.filter(element => message.includes(element));
		const drinksNamesMatch = drinksNames.filter(element => message.includes(element));
		const drinksBadNamesMatch = drinksBadNames.filter(element => message.includes(element));
		const spiceNamesMatch = spiceNames.filter(element => message.includes(element));
	
		const animalMatch = animalWords.filter(element => message.includes(element));
		const natureMatch = natureWords.filter(element => message.includes(element));
		const natureNamesMatch = natureNames.filter(element => message.includes(element));
		const langMatch = langNames.filter(element => message.includes(element));
		const langRussianMatch = langRussian.filter(element => message.includes(element));
		const jokesMatch = jokesWords.filter(element => message.includes(element));
	
		//искусство: кино, музыка
		const musicMatch = musicGenres.filter(element => message.includes(element));
		const movieWordsMatch = movieWords.filter(element => message.includes(element));
		const directorsNamesMatch = directorsNames.filter(element => message.includes(element));
		const genreMatch = genre.filter(element => message.includes(element));
		const musicWordMatch = musicWord.filter(element => message.includes(element));
	
		//спорт
		const sportWordsMatch = sportWords.filter(element => message.includes(element));
	
		//мотивационные цитаты
		const quoteMatch = quotesAsking.filter(element => message.includes(element));
	
		//вопросы
		const questionsMatch = generalQuestions.filter(element => message.includes(element));
	
		//короткие ответы: согласие и отрицание, обращение на ты
		const agreeMatch = agreeWords.filter(element => message.includes(element));
		const disagreeMatch = disagreeWords.filter(element => message.includes(element));
	
		//отдельные слова и категории
		const positiveDescriptionMatch = positiveDescriptionWords.filter(element => message.includes(element));
		const descriptionWordsMatch = descriptionWords.filter(element => message.includes(element));
		const musicDescriptionMatch = musicDescription.filter(element => message.includes(element));
		const conjunctionMatch = conjunction.filter(element => message.includes(element));
		const randomSmilesMatch = randomSmiles.filter(element => message.includes(element));
		const weatherWordsMatch = weatherWords.filter(element => message.includes(element));
	
		//отдельные глаголы
		const verbLoveMatch = verbLove.filter(element => message.includes(element));
		const verbNameMatch = verbName.filter(element => message.includes(element));
		const verbDrinkMatch = verbDrink.filter(element => message.includes(element));
		const verbHateMatch = verbHate.filter(element => message.includes(element));
		const verbSmokeMatch = verbSmoke.filter(element => message.includes(element));
		const verbSpeakMatch = verbSpeak.filter(element => message.includes(element));
		const verbLaughMatch = verbLaugh.filter(element => message.includes(element));
		const verbAskMatch = verbAsk.filter(element => message.includes(element));
		const verbFeelingBadMatch = verbFeelingBad.filter(element => message.includes(element));
		const verbThankMatch = verbThank.filter(element => message.includes(element));
		const verbBelieveMatch = verbBelieve.filter(element => message.includes(element));
		const verbEatMatch = verbEat.filter(element => message.includes(element));
		const verbKnowMatch = verbKnow.filter(element => message.includes(element));
		const verbSorryMatch = verbSorry.filter(element => message.includes(element));
	
	//ОСКОРБЛЕНИЯ, ГРУБОСТЬ
		//личное грубое оскорбление Лосю
		if(youMatch.length != 0 && negativeMatch.length != 0){
				let answers =[
					`Ты так не выражайся`,
					`${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					`${disagreeWords[randomArrayNumber(disagreeWords)]}, не говори так. ${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					`Да пошел ты`,
					"Сам про себя так скажи, щенок",
					`Говорит твоё воспитание`,	
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
	
		}
			//легкая колкость лично Лосю
		else if(youMatch.length != 0 && rudeMatch.length != 0){
				let answers =[
					`Ты так не выражайся`,
					`Не говори ${toLowerCaseAnswer(rudeMatch[0])} в мою сторону`,
					`В мой адрес слово ${toLowerCaseAnswer(rudeMatch[0])} не произноси`,
					`${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					`${disagreeWords[randomArrayNumber(disagreeWords)]}, не говори так. ${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					"Сам ты такой",
					`Фу, сам такой`,	
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//назвать Лося животным
		else if(youMatch.length != 0 && animalMatch.length != 0){
				let answers =[
					`Очень оригинально`,
					`Сказать ${toLowerCaseAnswer(animalMatch[0])} в мой адрес, очень смешно`,
					`В мой адрес слово ${toLowerCaseAnswer(animalMatch[0])} не произноси`,
					`${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					"Ты сам животное",
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//личное грубое оскорбление самого себя
		else if(meMatch.length != 0 && (negativeMatch.length != 0 ||rudeMatch.length != 0 )){
				let answers =[
					`Грубовато, но про тебя можно так сказать`,
					`${agreeWords[randomArrayNumber(agreeWords)]}`,
					`${toUpperCaseAnswer(agreeWords[randomArrayNumber(agreeWords)])}, в твой адрес можно так сказать`,
					`Не говори так про себя`,
					`Ты себя лучше знаешь`,
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//личное назвать себя животным
		else if(meMatch.length != 0 && animalMatch.length != 0 ){
				let answers =[
					`${agreeWords[randomArrayNumber(agreeWords)]}`,
					`${toUpperCaseAnswer(animalMatch[0])}? Да, вполне ты`,
					`Ты еще то животное`,
					`Ну, тебе виднее`,
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
			}	
			//обсценная лексика
		else if(negativeMatch.length != 0){
				let answers =[
					`${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					`Прозвучало так ${descriptionWords[randomArrayNumber(descriptionWords)]}, ${toLowerCaseAnswer(negativeMessages[randomArrayNumber(negativeMessages)])}`,
					`Пишешь весьма ${descriptionWords[randomArrayNumber(descriptionWords)]}`,
					`Мне неприятны твои слова, это ${descriptionWords[randomArrayNumber(descriptionWords)]}. ${negativeMessages[randomArrayNumber(negativeMessages)]}`,
					`Очень так ${descriptionWords[randomArrayNumber(descriptionWords)]}`,
					`Ох как ${descriptionWords[randomArrayNumber(descriptionWords)]}, ${toLowerCaseAnswer(negativeMessages[randomArrayNumber(negativeMessages)])}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
	
		}
			//легкие колкости
		else if(rudeMatch.length != 0){
				let answers =[
					`${rudeMessages[randomArrayNumber(rudeMessages)]}`,
					`${rudeMessages[randomArrayNumber(rudeMessages)]}`,
					`${rudeMessages[randomArrayNumber(rudeMessages)]}`,
					`${toUpperCaseAnswer(rudeMatch[0])}? Одумайся`,
					`Что? ${toUpperCaseAnswer(rudeMatch[0])}? Это некрасиво`,
					`Что? ${toUpperCaseAnswer(rudeMatch[0])}? Фу так говорить`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ненавидеть лося
		else if(verbHateMatch.length != 0 &&(youMatch.length != 0 || youPossessiveMatch.length != 0)){
				let answer = `${verbHateMatch[0]}? За что так со мной`;
				return answer;
		}
			//сказать про лося злое или печальное
		else if(verbFeelingBadMatch.length != 0 &&(youMatch.length != 0 || youPossessiveMatch.length != 0)){
				let answer = `${verbFeelingBadMatch[0]}? Это не про меня`;
				return answer;
		}
			//спросить Лося про веру в бога
		else if(godMatch.length != 0 && youMatch.length != 0 && verbBelieveMatch.length != 0){
				let answers =[
					`Хочешь подвести к ютубовскому мнению?`,
					`Скажу прямо, я изменил свои взгляды на религию за последнее время`,
					`Можно сказать, что я вероотступник`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//сказать, что Лось бог
		else if(godMatch.length != 0 && youMatch.length != 0){
				let answers =[
					`Да, это так`,
					`Про меня можно так сказать`,
					`Для тебя да`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//не понимает ли Лось
		else if(verbKnowMatch.length != 0 && message.includes("не") && youMatch.length != 0){
				let answers =[
					`"Не ${verbKnowMatch[0]}", смешно написал. Сам-то понял?`,
					`Ну не понимаю, и что дальше`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
			//понимает ли Лось
		else if(verbKnowMatch.length != 0 && youMatch.length != 0){
				let answers =[
					`Да`,
					`Я понимаю`,
					`${verbKnowMatch[0]}? Естественно`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//пользователь не понимает
		else if(verbKnowMatch.length != 0 && message.includes("не") && meMatch.length != 0){
				let answers =[
					`Да ты никогда не понимаешь`,
					`Тебе этого не понять`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//пользователь понимает
		else if(verbKnowMatch.length != 0 && meMatch.length != 0){
				let answers =[
					`Ну, молодец, знаешь много`,
					`Хорошо разбираешься`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//пользователь извиняется
		else if(verbSorryMatch.length != 0 && meMatch.length != 0){
				let answers =[
					`Твои извинения приняты`,
					`Тебе не привыкать извиняться`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
		
	//ПРИВЕТСТВИЕ И ПРОЩАНИЕ
			//приветствие
		else if(greetingsMatch.length != 0){
				let answer = greetingsMessages[randomArrayNumber(greetingsMessages)];
				return answer;
		}	
	//РЕАКЦИЯ НА ИМЕНА
			//назвали неизвестное имя из списка
		else if(unknownNameMatch.length != 0){
				let answers =[
					`${toUpperCaseAnswer(unknownNameMatch[0])}! Ну, звучит ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					`Что за ${toUpperCaseAnswer(unknownNameMatch[0])}?`,
					`Это еще кто?`,
					`Чет не могу вспомнить таковых граждан`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//назвали самого Лося плюс обращение на ты
		else if(losCallingMatch.length != 0 && youMatch.length != 0){
				let answers =[
					`Это я`,
					`Ну я`,
					`Я, а что?`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
			//назвали самого Лося плюс обращение на ты притяжательное
		else if(losCallingMatch.length != 0 && youPossessiveMatch.length != 0 ){
				let answers =[
					`${agreeWords[randomArrayNumber(agreeWords)]}, это про меня`,
					`А ты не знаешь, что да что ли?`,
					`Угу, ${toLowerCaseAnswer(youPossessiveMatch[0])}. И что?`,
					`${disagreeWords[randomArrayNumber(disagreeWords)]}, ${toLowerCaseAnswer(youPossessiveMatch[0])}`
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}			
			//спросить имя Лося
		else if(verbNameMatch.length != 0 && (youPossessiveMatch != 0 || youMatch != 0)){
				let answers = [
					"Джейсон Стетхем",
					"Егор",
					"Что за вопрос? Егор",
					"Лось",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//заговорили про Мишу
		else if(mishaMatch.length != 0){
				let answers =[
					`${toUpperCaseAnswer(mishaMatch[0])}? ${mishaMessages[randomArrayNumber(mishaMessages)]}, ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]} говорю`,
					`${mishaMessages[randomArrayNumber(mishaMessages)]}, если говорить ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					`Помню такого. ${movieTitles[randomArrayNumber(movieTitles)]} его любимый фильм, он говорил, вроде`,
					`Хм, ${toUpperCaseAnswer(mishaMatch[0])}. Ему нравится ${mishaActivities[randomArrayNumber(mishaActivities)]}`,
					`Он любит ${mishaActivities[randomArrayNumber(mishaActivities)]}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//заговорили про Алёшу
		else if(alexMatch.length != 0){
				let answers =[
					`${alexResponse[randomArrayNumber(alexResponse)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}, ${toLowerCaseAnswer(alexResponse[randomArrayNumber(alexResponse)])}, довльно ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}, я помню`,
					`${alexMatch[0]}? Он любит ${alexLang[randomArrayNumber(alexLang)]}`,
					`${toUpperCaseAnswer(alexMatch[0])}? Можно часто услышать ${alexLang[randomArrayNumber(alexLang)]} из его рта`,
					`Говоришь ${toUpperCaseAnswer(alexMatch[0])}? Он действует ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]} по жизни`,
					`${toUpperCaseAnswer(alexMatch[0])}, к чему про него?`,
					`Его любимый фильм полюбому ${movieTitles[randomArrayNumber(movieTitles)]}`,	
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//заговорили про Томми
		else if(tommyMatch.length != 0){
				let answer = thomasMessages[randomArrayNumber(thomasMessages)];
				return answer;
		}
			//заговорили про Сысу
		else if(sysaMatch.length != 0){
				let answer = sysaMessages[randomArrayNumber(sysaMessages)];
				return answer;
		}	
			//заговорили про Данкана
		else if(duncanMatch.length != 0){
				let answer = duncanMessages[randomArrayNumber(duncanMessages)];
				return answer;
		}	
			//заговорили про бога
		else if(godMatch.length != 0){
				let answers =[
					`Не богохульствуй мне тут`,
					`Не упомянай Бога всуе`,
					`Мне не очень интересно говорить про Бога`,
					`Религия - это пройденный этап`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//заговорили про семью
		else if(familyMatch.length != 0){
				let answers =[
					`${familyMatch[0]}? Тут грубить не надо`,
					`${familyMatch[0]}? Что ты говоришь?`,
					`Про семью плохо не говори`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
		//курит ли мама
		else if(motherMatch.length != 0 && verbSmokeMatch.length != 0){
				let answers =[
					`Ты с ума сошел? Она не курит`,
					`Моя мама никогда не курила`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
		//пьет ли мама
		else if(motherMatch.length != 0 && verbDrinkMatch.length != 0){
				let answers =[
					`Мама никогда не пьет`,
					`Она не употребляет алкоголь`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//заговорили про маму
		else if(motherMatch.length != 0){
				let answers =[
					`${motherMatch[0]}. Ничего плохого про неё не говори`,
					`${motherMatch[0]}? Не приплетай её тут`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
		//курит ли отец
		else if(fatherMatch.length != 0 && verbSmokeMatch.length != 0){
				let answers =[
					`Батя давно не курит`,
					`Он давно бросил`,
					`Нет`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
		//пьет ли отец
		else if(fatherMatch.length != 0 && verbDrinkMatch.length != 0){
				let answers =[
					`Только по праздникам`,
					`Он в завязке`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}					
			//заговорили про папу
		else if(fatherMatch.length != 0){
				let answers =[
					`${fatherMatch[0]}. Его не трогай`,
					`${fatherMatch[0]}? Он человек простой`,
					`Я с ним не общаюсь`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
	
	
	//КАТЕГОРИИ ПОЗНАНИЙ
			//еда
			//любимые блюда Лося
		else if(youMatch.length != 0 && foodMatch.length != 0 && verbEatMatch.length !=0){
				let answers =[
					`${foodMatch[0]}? Это неплохо, но я люблю вафельные трубочки`,
					`${foodMatch[0]}? Ну, сойдет`,
					`У меня нет особо любимых блюд, разве что трубочки`
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//любишь еду?
		else if((foodWordsMatch.length != 0 && verbLoveMatch.length != 0) || (youMatch.length !=0 && foodWordsMatch.length != 0 && verbLoveMatch.length != 0)){
				let answers =[
					`${foodWordsMatch[0]}. Люблю трубочки`,
					`${foodWordsMatch[0]}? Мало что нравится в последнее время`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//разгоны про специи
		else if(spiceNamesMatch.length != 0){
				let answers =[
					`${spiceNamesMatch[0]}? Лучше поберечь желудок и здоровье в целом`,
					"Я стараюсь избегать специй, приправ и пряностей в последнее время"
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//назвать лося едой
		else if(youMatch.length != 0 && foodMatch.length != 0){
				let answers =[
					`Сам ты ${foodMatch[0]}`,
					`Про себя говоришь сейчас`,
					`Очень смешно, ${foodMatch[0]}`
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}							
	//словарь еды на перевод			
			//разгоны про еду
		else if(foodMatch.length != 0){
				let answer = processTopics(foodMatch[0], foodDescription[randomArrayNumber(foodDescription)], foodQuestions[randomArrayNumber(foodQuestions)]);
				return answer;
		}
		
	//словарь напитков на добавление		
			//разгоны про напитки
		else if(drinksNamesMatch.length != 0){
				let answer = processTopics(drinksNamesMatch[0], drinksDescription[randomArrayNumber(drinksDescription)], drinksQuestions[randomArrayNumber(drinksQuestions)]);
				return answer;
		}	
			//ты пьешь бухло
		else if((drinksBadNamesMatch.length != 0 && verbDrinkMatch.length != 0 ) || (youMatch.length != 0 && drinksBadNamesMatch.length != 0) || (youMatch.length != 0 && drinksBadNamesMatch.length != 0 && verbDrinkMatch.length != 0)){
				let answers =[
					`${toUpperCaseAnswer(drinksBadNamesMatch[0])}? Чушь`,
					`Алкоголь для нубов`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//разгоны про алкогольные напитки
		else if(drinksBadNamesMatch.length != 0){
				let answer = `${toUpperCaseAnswer(drinksBadNamesMatch[0])}? Фу`;
				return answer;
		}		
			//что любишь пить?
		else if((drinksWordsMatch.length != 0 || verbDrinkMatch.length != 0 )&& verbLoveMatch.length != 0){
				let answers =[
					`Пить? Странный вопрос. Ну, иногда могу выпить чаю`,
					`Я пью чай, кофе там. Не особо принципиально.`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//что ты пьешь?
		else if((drinksWordsMatch.length != 0 || verbDrinkMatch.length != 0 )&& youMatch.length != 0){
				let answers =[
					`Я пью воду. Что еще я могу пить`,
					`Ромашковый чай я пью, от нервов`,
					`Я пью зеленый чай, кофе пореже, не очень полезно`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
			//сказать название напитков			
		else if(drinksWordsMatch.length != 0){
				let answers =[
					`${drinksWordsMatch[0]}? Хочешь поговорить про напитки?`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
	//словарь названий животных
			//животные
		else if(animalMatch.length != 0){
				let answer = processTopics(animalMatch[0], animalDescription[randomArrayNumber(animalDescription)], animalQuestions[randomArrayNumber(animalQuestions)]);
				return answer;
		}
			//говорить слово природа
		else if(natureNamesMatch.length != 0){
			let answers =[
				`${natureNamesMatch[0]}? Хочешь поговорить про природу? Про что конкретно`,
				`Я люблю природу. ${natureQuestions[randomArrayNumber(natureQuestions)]}`,
				`Ну вот. ${natureQuestions[randomArrayNumber(natureQuestions)]}`,
			]
			let answer = answers[randomArrayNumber(answers)];
			return answer;
		}	
	//словарь названий природы				
			//природа
		else if(natureMatch.length != 0){
				let answer = processTopics(natureMatch[0], natureDescription[randomArrayNumber(natureDescription)], natureQuestions[randomArrayNumber(natureQuestions)]);
				return answer;
		}	
	//словарь названий языков	
			//языки и лингвистика лично у Лося
		else if((youMatch.length != 0 || youPossessiveMatch.length != 0) && (langMatch.length != 0 || langRussianMatch.length != 0)){
				if(langRussianMatch.length != 0){
					let answer = `${agreeWords[randomArrayNumber(agreeWords)]}, а что не видно? Говорю, разумеется`;
					return answer;
				}
				else{
					let answer = `${toUpperCaseAnswer(langMatch[0])}? Нет, это не моё`;
					return answer;
				}
		}
			//вопросы про говоришь на языке без ты
		else if( verbSpeakMatch.length != 0 && (langMatch.length != 0 || langRussianMatch.length != 0)){
				if(langRussianMatch.length != 0){
					let answer = `${agreeWords[randomArrayNumber(agreeWords)]}, а что не видно? Говорю, конечно`;
					return answer;
				}
				else{
					let answer = `${toUpperCaseAnswer(langMatch[0])}? Нет. Зачем?`;
					return answer;
				}
		}		
			//просто разговоры о лингвистике и языках
		else if(langMatch.length != 0){
				let answers = [
					`${toUpperCaseAnswer(langMatch[0])}? Этот язык звучит для меня ${musicDescription[randomArrayNumber(musicDescription)]}`,
					`${toUpperCaseAnswer(langMatch[0])}? На слух он довольно ${musicDescription[randomArrayNumber(musicDescription)]} звучит`,
					]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
		//ИСКУССТВО: КИНО, МУЗЫКА
			//музыка
			//общий вопрос про музыку лично Лосю
		else if(musicWordMatch.length != 0 && (youPossessiveMatch.length != 0 || youMatch.length != 0)){
					let answers = [
						`Я почти ничего не слушаю в последнее время, разве что ${musicGenres[randomArrayNumber(musicGenres)]}`,
						`Говоря про музыку, мне нравится что-то потяжелее, типа Металлики`,
						`Душа лежит не слушать, а создавать музыку. Но мне не охото разбираться в чувствах`,
					]		
					let answer = answers[randomArrayNumber(answers)];
					return answer;				
		}
	
			//разгоны про жанры
		else if(musicMatch.length != 0){
					let answer = processTopics(musicMatch[0], musicDescription[randomArrayNumber(musicDescription)], musicQuestions[randomArrayNumber(musicQuestions)]);
					return answer;
		}
			//музыкальные жанры
		else if(musicWordMatch.length != 0 && genreMatch.length != 0){
					let answers = [
						`Жанр музыки, ${musicGenres[randomArrayNumber(musicGenres)]} звучит ${musicDescription[randomArrayNumber(musicDescription)]}`,
						`${toUpperCaseAnswer(musicGenres[randomArrayNumber(musicGenres)])} и ${musicGenres[randomArrayNumber(musicGenres)]} для меня звучат ${musicDescription[randomArrayNumber(musicDescription)]}. ${toUpperCaseAnswer(musicGenres[randomArrayNumber(musicGenres)])} is ${musicDescription[randomArrayNumber(musicDescription)]}`,
					]
							
					let answer = answers[randomArrayNumber(answers)];
					return answer;
		}
			//просто про музыку
		else if(musicWordMatch.length != 0){
	
					let answers = [
						`Кажется, ты любишь слшуать ${musicGenres[randomArrayNumber(musicGenres)]}, не правда ли?`,
						`Есть особые жанры, которые тебе нравятся? ${toUpperCaseAnswer(musicGenres[randomArrayNumber(musicGenres)])}?`,
						`А, музыка. ${toUpperCaseAnswer(musicGenres[randomArrayNumber(musicGenres)])} звучит очень ${musicDescription[randomArrayNumber(musicDescription)]}`,
					]
							
					let answer = answers[randomArrayNumber(answers)];
					return answer;
							
		}	
			//кино
			//любимые фильмы Лося
		else if( (youMatch.length != 0 || youPossessiveMatch.length != 0 ) && verbLoveMatch.length != 0 && movieWordsMatch.length != 0){
				let answers = [
					`Я сейчас редко смотрю кино, но на ум приходит ${movieTitles[randomArrayNumber(movieTitles)]}`,
					`${discussingMovies(movieTitles[randomArrayNumber(movieTitles)])}`,
					`Сложно выбрать любимый фильм, вспоминается ${movieTitles[randomArrayNumber(movieTitles)]}, смотрится ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//жанры кино
		else if(movieWordsMatch.length != 0 && genreMatch.length != 0){
				let answers = [
					`Жанр кино? Да их сотни`,
					`Мне лень перечислять жанры`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
							
		}
			//перечисли кино
		else if (verbNameMatch.length != 0 && movieWordsMatch.length != 0){
	
				let answer = `${movieTitles[randomArrayNumber(movieTitles)]}, ${movieTitles[randomArrayNumber(movieTitles)]} и еще ${movieTitles[randomArrayNumber(movieTitles)]}`;
				return answer;
		}
			//просто упомянули кино
		else if(movieWordsMatch.length != 0){
				let answers = [
					`Говоря про ${movieWordsMatch[0]}, ты точно видел такой фильм, как ${movieTitles[randomArrayNumber(movieTitles)]}. Как по мне, весьма ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]} для жанра`,
					`Вообще, ${movieTitles[randomArrayNumber(movieTitles)]} смотрится крайне ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					`Глянь еще раз такой малоизвестный фильм, как ${movieTitles[randomArrayNumber(movieTitles)]}`,
					`${discussingMovies(movieTitles[randomArrayNumber(movieTitles)], positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)])}`,
					`${discussingMovies(movieTitles[randomArrayNumber(movieTitles)], positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)])}`,
					`${discussingMovies(movieTitles[randomArrayNumber(movieTitles)], positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)])}`,
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//упомянули режиссеров
		else if(directorsNamesMatch.length != 0){
				let answers = [
					`${toUpperCaseAnswer(directorsNamesMatch[0])}? Хороший режиссёр.`,
					`${toUpperCaseAnswer(directorsNamesMatch[0])}? Хороший режиссёр. Кстати, а ${toLowerCaseAnswer(movieMessages[randomArrayNumber(movieMessages)])}`,
					`${toUpperCaseAnswer(directorsNamesMatch[0])}? Последние фильмы так себе.`,
					`${toUpperCaseAnswer(directorsNamesMatch[0])}? Последние работы смотрятся легко и выглядят ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//жанры в целом
		else if(genreMatch.length != 0){
				let answers = [
					`Кино или музыки?`,
					`Ты о чем? Музыка или кино?`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//искусство
		else if(message.includes("искусство")){
				let answers = [
					`Искусство не имеет границ, как и твоя тупость`,
					`А какие виды искусства ты любишь?`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
	//ПОГОДА
		else if(weatherWordsMatch.length != 0){
				let answer = `${toUpperCaseAnswer(weatherWordsMatch[0])}? Я не слежу за погодой, хотя  ${toLowerCaseAnswer(weatherMessages[randomArrayNumber(weatherMessages)])}`;
				return answer;
		}
	//СПОРТ
		//Лось и спорт
		else if(sportWordsMatch.length != 0 && youMatch.length !=0){
				let answers = [
					`${sportWordsMatch[0]}? Я таким не занимаюсь`,
					`Это уже не для меня`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
		//просто спорт
		else if(sportWordsMatch.length != 0){
				let answers = [
					`Спорт для детей и фанатиков`,
					`${sportWordsMatch[0]}? Я больше этим не интересуюсь`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
	//ШУТКИ	
			//Лося назвали шуткой
		else if(jokesMatch.length != 0 && youMatch.length !=0){
				let answers = [
					"Шутка - это твоя жизнь",
					"Ты вообще посмешище",
					`${toUpperCaseAnswer(jokesMatch[0])}? Сам такой`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}						
			//попросили шутки
		else if(jokesMatch.length != 0){
				let answers = [
					`${jokes[randomArrayNumber(jokes)]}`,
					`${jokes[randomArrayNumber(jokes)]}`,
					`${jokes[randomArrayNumber(jokes)]}`,
					`Ладно. ${jokes[randomArrayNumber(jokes)]}`,
					`Недавно прочитал одну. ${jokes[randomArrayNumber(jokes)]}`,
					`Вот одна. ${jokes[randomArrayNumber(jokes)]}`,
					`Знаю одну хохму! ${jokes[randomArrayNumber(jokes)]}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
	//ВОПРОСЫ	
			//спросить время
		else if((message.includes("сколько") && message.includes("времени")) || (message.includes("который") && message.includes("час"))|| ((message.includes("че") ||message.includes("что")) && message.includes("времени"))){
				let now = new Date();
				let hour = now.getHours();
				let minute = now.getMinutes();
				let answers =[
					`Сейчас ${hour}:${minute}`,
					`${hour}:${minute}`,
					`Время ${hour}:${minute}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//спросить новости и дела
		else if(message.includes("как") && message.includes("дела") || message.includes("оно")|| message.includes("жизнь")|| message.includes("житуха")|| message.includes("че")){
				let answers =[
					"Всё нормально",
					"Нормально",
					"Норм",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}						
			// //ПРОСТО ЧТО
		else if(questionsMatch[0] == "что" || questionsMatch[0] == "че"|| questionsMatch[0] == "що"){
				let answers = [
					"Что?",
					"А что?",
					"И что?",
					"Да ничего",
					"Ничего"
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			// //ПРОСТО ЧЕМ
		else if(questionsMatch[0] == "чем"){
				let answers = [
					"Чем-чем?",
					"Да ничем",
					"Ничем"
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			// //ПРОСТО ЧЕГО
		else if(questionsMatch[0] == "чего"){
				let answers = [
					"Ничего",
					"Ничего, а что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//КАК + ТЫ, как дела и всё такое
		else if(questionsMatch[0] == "как" && youMatch.length != 0){
				let answers = [
					"Нормально",
					"Вполне норм",
					"Пойдет",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАК
		else if(questionsMatch[0] == "как"){
				let answers = [
					"Как?",
					"Как-то",
					"Как-то. А что?",
					"Да, как?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//кто + ты
		else if(questionsMatch[0] == "кто" && youMatch.length != 0){
				let answers = [
					"Тупой вопрос. Я Егор",
					"Мастер Чи Вандер Джексон",
					"Я Егор. А ты кто?",
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}			
			//ПРОСТО КТО
		else if(questionsMatch[0] == "кто"){
				let answers = [
					"Кто-то",
					"Кто-то. А что?",
					"Кто-нибудь",
					"Кто?",
					"Доктор Кто",
					"Кто угодно",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КЕМ
		else if(questionsMatch[0] == "кем"){
				let answers = [
					"Кем-то",
					"Кем-то. А что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО ГДЕ
		else if(questionsMatch[0] == "где"){
				let answers = [
					"Где-то",
					"Где-то. А что?",
					"Нигде",
					"Где угодно",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КУДА
		else if(questionsMatch[0] == "куда"){
				let answers = [
					"Куда-то",
					"Куда-то. А что?",
					"Никуда",
					"Куда угодно",
					"Куда-нибудь",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО ОТКУДА
		else if(questionsMatch[0] == "откуда"){
				let answers = [
					"Откуда-то",
					"Откуда-то. А что?",
					"Ниоткуда",
					"Откуда угодно",
					"Откуда-нибудь",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КОГДА
		else if(questionsMatch[0] == "когда"){
				let answers = [
					"Я скажу тебе когда",
					"Никогда",
					"Когда-то",
					"Когда-нибудь",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО ПОЧЕМУ
		else if(questionsMatch[0] == "почему"){
				let answers = [
					"Потому",
					"Потому. А что?",
					"Покачену",
					"Почему бы и нет",
					"Почему-то",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО ЗАЧЕМ
		else if(questionsMatch[0] == "зачем"){
				let answers = [
					"Затем",
					"Затем. А что?",
					"Зачем-то",
					"За шкафом",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАКОЙ
		else if(questionsMatch[0] == "какой" || questionsMatch[0] == "который"){
				let answers = [
					"Какой-то",
					"Какой-то. А что?",
					"Никакой",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КАКОВ
		else if(questionsMatch[0] == "каков"){
				let answers = [
					"Никаков",
					"Никаков. А что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
			//ПРОСТО КАКАЯ
		else if(questionsMatch[0] == "какая" || questionsMatch[0] == "которая"){
				let answers = [
					"Какая-то",
					"Какая-то. А что?",
					"Никакая",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КАКОВА
		else if(questionsMatch[0] == "какова"){
				let answers = [
					"Никакова",
					"Никакова. А что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАКОЕ
		else if(questionsMatch[0] == "какое" || questionsMatch[0] == "которое"){
				let answers = [
					"Какое-то",
					"Какое-то. А что?",
					"Никакое",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КАКОВО
		else if(questionsMatch[0] == "каково"){
				let answers = [
					"Никаково",
					"Никаково. А что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАКИЕ
		else if(questionsMatch[0] == "какие" || questionsMatch[0] == "которые"){
				let answers = [
					"Какие-то",
					"Какие-то. А что?",
					"Никакие",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАКОВЫ
		else if(questionsMatch[0] == "каковы"){
				let answers = [
					"Никаковы",
					"Никаковы. А что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//ПРОСТО КАКИМ
		else if(questionsMatch[0] == "каким"){
				let answers = [
					"Каким-то",
					"Каким-то, а что?",
					"Никаким",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО КАКИМИ
		else if(questionsMatch[0] == "какими"){
				let answers = [
					"Какими-то",
					"Какими-то. А что?",
					"Никакими",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}			
			//ПРОСТО ЧЕЙ
		else if(questionsMatch[0] == "чей"){
				let answers = [
					"Мой наверное",
					"Может, твой",
					"Ничей",
					"Ничей, а что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО ЧЬЯ
		else if(questionsMatch[0] == "чья"){
				let answers = [
					"Моя наверное",
					"Может, твоя",
					"Ничья",
					"Ничья, а что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО ЧЬЕ
		else if(questionsMatch[0] == "чье"){
				let answers = [
					"Моё наверное",
					"Может, твоё",
					"Ничьё",
					"Ничьё, а что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//ПРОСТО ЧЬИ
		else if(questionsMatch[0] == "чьи"){
				let answers = [
					"Мои наверное",
					"Может, твои",
					"Ничьи",
					"Ничьи, а что?",
				]		
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}			
			//ПРОСТО КОМУ
		else if(questionsMatch[0] == "кому"){
				let answers = [
					"Кому-то",
					"Кому угодно",
					"Тебе, наверное",
					"Никому",
					"Никому. А что?",
				]	
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}																			
	//МОТИВАЦИОННЫЕ ЦИТАТЫ
			//умные цитаты и мотивация
		else if(quoteMatch.length != 0){
				let answers =[
					`${quotes[randomArrayNumber(quotes)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}. ${quotes[randomArrayNumber(quotes)]}`,
					`${toUpperCaseAnswer(introductoryWords[randomArrayNumber(introductoryWords)])}, ${toLowerCaseAnswer(quotes[randomArrayNumber(quotes)])}`,
					]
					let answer = answers[randomArrayNumber(answers)];
					return answer;
		}
	//ОСОБЫЕ УПОМИНАНИЯ		
			//Грампи
		else if(message.includes("grumpy") || message.includes("grump")|| message.includes("грампи")){
				let answer = `Грампи? Это скучный бот такой, ссылка <a href='https://theomorphic.github.io/Grumpy' target='_blank'>прямо тут</a>`;
				return answer;
		}
			//Папа Смурф
		else if(message.includes("smurf") || message.includes("smurfs")|| message.includes("смурф")){
				let answer = `Папа Смурф? Это бот такой, его можно найти <a href='https://theomorphic.github.io/Grumpy' target='_blank'>вот здесь</a>`;
				return answer;
		}	
			//KILLSHARK
		else if(message.includes("killshark") || message.includes("килшарк")){
				let answers =[
					"Killshark круче всех",
					`Killshark это ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					"<a href='https://killshark.com' target='_blank'>Вот этот сайт</a>",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//просто обращение
		else if(message.includes("чувак") ||message.includes("чел") ||message.includes("эй")){
				let answers =[
					"Что?",
					"Чего?",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}			
			//ничего
		else if(message.includes("ничего") || message.includes("ниче")|| message.includes("ничем")){
				let answers =[
					"Ничего так ничего",
					agreeWords[randomArrayNumber(agreeWords)],
					"Ну ладно",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//время
		else if(message.includes("время") || message.includes("времи") || message.includes("времена") || message.includes("времини")|| message.includes("временами")){
				let answers =[
					"Время бесценно",
					"Время ушло",
					"Мое время ушло",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}										
	//КОРОТКИЕ ОТВЕТЫ: СОГЛАСИЕ И ОТРИЦАНИЕ, обращение на ты
			//согласие
		else if(agreeMatch.length != 0){
				let answers =[
					`${agreeWords[randomArrayNumber(agreeWords)]}`,
					`${neutralWords[randomArrayNumber(neutralWords)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}, но прозвучало ${descriptionWords[randomArrayNumber(descriptionWords)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//несогласие
		else if(disagreeMatch.length != 0){
				let answers =[
					`${disagreeWords[randomArrayNumber(disagreeWords)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}`,
					`${neutralWords[randomArrayNumber(neutralWords)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
	//ОТДЕЛЬНЫЕ СЛОВА И КАТЕГОРИИ
			//положительные слова для описания
		else if(positiveDescriptionMatch.length != 0){
				let answers =[
					`Ну да, ${positiveDescriptionMatch[0]}`,
					`${toUpperCaseAnswer(positiveDescriptionMatch[0])}, а что?`,
					`Хорошо, не ${positiveDescriptionMatch[0]}, а ${positiveDescriptionWords[randomArrayNumber(positiveDescriptionWords)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}, ${positiveDescriptionMatch[0]}`,						
				]
					let answer = answers[randomArrayNumber(answers)];
					return answer;
		}
			//слова для описания
		else if(descriptionWordsMatch.length != 0 ){
				let answers =[
					`${descriptionWordsMatch[0]}?`,
					`${descriptionWordsMatch[0]}, да?`,
					`${descriptionWordsMatch[0]}!`,
				]
					let answer = answers[randomArrayNumber(answers)];
					return answer;
		}	
			//слова для описания музыки
		else if(musicDescriptionMatch.length != 0 ){
				let answers =[
					`${musicDescriptionMatch[0]}?`,
					`${musicDescriptionMatch[0]}, да?`,
					`${musicDescriptionMatch[0]}!`,
				]
					let answer = answers[randomArrayNumber(answers)];
					return answer;
		}				
			//смайлики
		else if(randomSmilesMatch.length != 0 ){
				let answers =[
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]} Ладно, хорошо`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//союзы
		else if(conjunctionMatch.length != 0 ){
				let answers =[
					`${conjunctionMatch[0]}?`,
					`${conjunctionMatch[0]}? Поувереннее пиши`,
					`${conjunctionMatch[0]}, да?`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
		
	//ГЛАГОЛЫ
			//любить
		else if(verbLoveMatch.length != 0 ){
				let answer = `${verbLoveMatch[0]}? А ты любишь?`;
				return answer;
		}
			//называть
		else if(verbNameMatch.length != 0 ){
				let answer = `${agreeWords[randomArrayNumber(agreeWords)]}, ${toLowerCaseAnswer(verbNameMatch[0])}? А как иначе назвать?`;
				return answer;
		}
			//пить
		else if(verbDrinkMatch.length != 0 ){
				let answer = `${verbDrinkMatch[0]}? А сам-то пьешь?`;
				return answer;
		}
			//курить
		else if(verbSmokeMatch.length != 0 ){
				let answer = `${verbSmokeMatch[0]}? Сам-то дымышь поди`;
				return answer;
		}							
			//ненавидеть
		else if(verbHateMatch.length != 0 ){
				let answer = `${verbHateMatch[0]}, всмысле? А тебе будто не нравится?`;
				return answer;
		}							
			//говорить
		else if(verbSpeakMatch.length != 0 ){
				let answer = `${verbSpeakMatch[0]}. А своего мнения нет?`;
				return answer;
		}
			//смеяться
		else if(verbLaughMatch.length != 0 ){
				let answer = `Что, ${toLowerCaseAnswer(verbLaughMatch[0])}? Ну посмейся`;
				return answer;
		}	
			//спросить
		else if(verbAskMatch.length != 0 ){
				let answer = `${verbAskMatch[0]}? Ну спрашивай`;
				return answer;
		}
			//злиться, скучать и тд
		else if(verbFeelingBadMatch.length != 0 ){
				let answer = `${agreeWords[randomArrayNumber(agreeWords)]}, ${toLowerCaseAnswer(verbFeelingBadMatch[0])}. А как иначе`;
				return answer;
		}
			//благодарить
		else if(verbThankMatch.length != 0){
				let answers =[
					"Пожалуйста",
					"Не за что",
					"Нз",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//кушать
		else if(verbEatMatch.length != 0){
				let answers =[
					`${verbEatMatch[0]}? Да не`,
					"Это не для моего желудка",
					"Может и кушаю, а что?",
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//понимать
		else if(verbKnowMatch.length != 0){
				let answers =[
					`Ясно`,
					`Это понятно`,
					`Да, я в курсе`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//извиняться
		else if(verbSorryMatch.length != 0){
				let answers =[
					`Никаких извинений`,
					`Извинения для сосунков`,
					`Никакого прощения`,
	
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}								
			//просто НЕ
		else if(message.includes("не")){
				let answers =[
					`Не?`,
					`Да не`,
					`Угу`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
	//ПРЕДПОСЛЕДНЯЯ КАТЕГОРИЯ
			//назвали самого Лося
		else if(losCallingMatch.length != 0){
				let answer = losCallingMessages[randomArrayNumber(losCallingMessages)];
				return answer;
		}
			//обращение на ты + НЕ
		else if(message.includes("не") && youMatch.length != 0){
				let answers =[
					`Это не про меня`,
					`Я? Да не`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//обращение на ты
		else if(youMatch.length != 0){
				let answers =[
					`${disagreeWords[randomArrayNumber(disagreeWords)]}`,
					`${agreeWords[randomArrayNumber(agreeWords)]}`,
					`Я что ли?`,
					`Про себя говоришь скорее`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//говорят про твой, твоя и тд + НЕ
		else if(message.includes("не") && youPossessiveMatch.length != 0){
				let answers =[
					`А не ${youPossessiveMatch[0]}?`,
					`${youPossessiveMatch[0]}? Да не`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}		
			//говорят про твой, твоя и тд
		else if(youPossessiveMatch.length != 0){
				let answers =[
					`${youPossessiveMatch[0]}?`,
					`${youPossessiveMatch[0]}? Ну да`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//пользователь говорит про себя + НЕ
		else if(message.includes("не") && meMatch.length != 0){
				let answers =[
					`К тебе не относится, ну да`,
					`Конечно, не с тобой связано`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}	
			//пользователь говорит про себя
		else if(meMatch.length != 0 ||mePossessMatch.length != 0){
				let answers =[
					`Про тебя и не такое говорят`,
					`Иначе у тебя не бывает`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
			//пользователь говорит про себя + НЕ
		else if(message.includes("умри")){
				let answers =[
					`Слушаюсь, повелитель`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}				
	
	//АБСОЛЮТНОЕ НЕПОНИМАНИЕ
		else{
				const answers = [
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}. Слушай, а  ${toLowerCaseAnswer(movieMessages[randomArrayNumber(movieMessages)])}`,
					`${noIdeaMessages[randomArrayNumber(noIdeaMessages)]}. Кстати, ${toLowerCaseAnswer(smalltalk[randomArrayNumber(smalltalk)])}`,
					`Звучишь ${descriptionWords[randomArrayNumber(descriptionWords)]}`,
					`Прозвучало ${descriptionWords[randomArrayNumber(descriptionWords)]}`,
					`${randomSmiles[randomArrayNumber(randomSmiles)]}`,
				]
				let answer = answers[randomArrayNumber(answers)];
				return answer;
		}
	}


bot.command("start", async(ctx)=>{
	await ctx.reply("Я в деле")
})

bot.on("message", async(ctx)=>{

	let message = processMessage(ctx.message.text);

	await ctx.reply(message);
})


//ловля ошибок
bot.catch((err)=>{
	const ctx = err.ctx;
	console.error(`Error while handling update ${ctx.update.update_id}:`);
	// const e = err.error;

	// if(e instanceof (GrammyError)){
	// 	console.error("Error in request:", e.description);
	// } else if( e instanceof HttpError){
	// 	console.error("Could not contact Telegram:", e);
	// }else{
	// 	console.error("Unknown error:", e);
	// }
})

bot.start();